{
  "irVersion": "1.0",
  "workbook": {
    "name": "(Active) 2021 Q3 Dealer Buying Event",
    "pascalName": "Active2021Q3DealerBuyingEvent",
    "sourcePath": "C:/Users/BoghraJeelKishorbhai/Deterministic-Agentic/Data/Q3 Buyer/(Active) 2021 Q3 Dealer Buying Event.twb",
    "version": "18.1",
    "platform": ""
  },
  "dataSources": [
    {
      "name": "Sheet1 (Launch Data)",
      "internalName": "federated.117jb1u1i0ngbn1ed54pj0xj96lf",
      "connectionClass": "excel-direct",
      "sourceType": "Excel",
      "files": [
        "C:/Users/jagerb/Desktop/Q3 Launch Data.xlsx"
      ],
      "server": "",
      "database": null,
      "schema": null,
      "tables": [
        "Sheet1$",
        "Extract].[Extract"
      ],
      "relations": [
        {
          "schema": null,
          "table": "Sheet1$",
          "type": "table"
        },
        {
          "schema": "Extract",
          "table": "Extract",
          "type": "table"
        }
      ],
      "joins": [],
      "customSql": null,
      "connectionMode": "import",
      "active": true
    }
  ],
  "columns": [
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Item Code",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 0,
      "physicalTable": "Sheet1",
      "remoteName": "Item Code",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Delivery Month",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 1,
      "physicalTable": "Sheet1",
      "remoteName": "Delivery Month",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Base Part Number",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 2,
      "physicalTable": "Sheet1",
      "remoteName": "Base Part Number",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Macro Area",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 3,
      "physicalTable": "Sheet1",
      "remoteName": "Macro Area",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Sales Area",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 4,
      "physicalTable": "Sheet1",
      "remoteName": "Sales Area",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Micro Area",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 5,
      "physicalTable": "Sheet1",
      "remoteName": "Micro Area",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Year",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 6,
      "physicalTable": "Sheet1",
      "remoteName": "Year",
      "metaType": "integer"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Month",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 7,
      "physicalTable": "Sheet1",
      "remoteName": "Month",
      "metaType": "integer"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Date",
      "caption": null,
      "dataType": "date",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 8,
      "physicalTable": "Sheet1",
      "remoteName": "Date",
      "metaType": "date"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Sum of Quantity (Units)",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 9,
      "physicalTable": "Sheet1",
      "remoteName": "Sum of Quantity (Units)",
      "metaType": "integer"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Sum of Extra Quantity (Units)",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 10,
      "physicalTable": "Sheet1",
      "remoteName": "Sum of Extra Quantity (Units)",
      "metaType": "integer"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Order Quantity",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 11,
      "physicalTable": "Sheet1",
      "remoteName": "Order Quantity",
      "metaType": "integer"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Cost",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 12,
      "physicalTable": "Sheet1",
      "remoteName": "Cost",
      "metaType": "real"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Dnet",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 13,
      "physicalTable": "Sheet1",
      "remoteName": "Dnet",
      "metaType": "real"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "MSRP",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 14,
      "physicalTable": "Sheet1",
      "remoteName": "MSRP",
      "metaType": "real"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Product Cost $",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 15,
      "physicalTable": "Sheet1",
      "remoteName": "Product Cost $",
      "metaType": "real"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Order $",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 16,
      "physicalTable": "Sheet1",
      "remoteName": "Order $",
      "metaType": "real"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Order $ (MSRP)",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 17,
      "physicalTable": "Sheet1",
      "remoteName": "Order $ (MSRP)",
      "metaType": "real"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Margin $",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 18,
      "physicalTable": "Sheet1",
      "remoteName": "Margin $",
      "metaType": "real"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Style",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 19,
      "physicalTable": "Sheet1",
      "remoteName": "Style",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Style Code",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 20,
      "physicalTable": "Sheet1",
      "remoteName": "Style Code",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Style Description",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 21,
      "physicalTable": "Sheet1",
      "remoteName": "Style Description",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Reorder Type",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 22,
      "physicalTable": "Sheet1",
      "remoteName": "Reorder Type",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Garment Type",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 23,
      "physicalTable": "Sheet1",
      "remoteName": "Garment Type",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Product Gender",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 24,
      "physicalTable": "Sheet1",
      "remoteName": "Product Gender",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Product Category",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 25,
      "physicalTable": "Sheet1",
      "remoteName": "Product Category",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Product Family",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 26,
      "physicalTable": "Sheet1",
      "remoteName": "Product Family",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Product Sub-Family",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 27,
      "physicalTable": "Sheet1",
      "remoteName": "Product Sub-Family",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Collection",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 28,
      "physicalTable": "Sheet1",
      "remoteName": "Collection",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Delivery Season",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 29,
      "physicalTable": "Sheet1",
      "remoteName": "Delivery Season",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Delivery Date",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 30,
      "physicalTable": "Sheet1",
      "remoteName": "Delivery Date",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Gender/Stature/Type",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 31,
      "physicalTable": "Sheet1",
      "remoteName": "Gender/Stature/Type",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Base Style",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 32,
      "physicalTable": "Sheet1",
      "remoteName": "Base Style",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Color",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 33,
      "physicalTable": "Sheet1",
      "remoteName": "Color",
      "metaType": "string"
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": ":Measure Names",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": null
    }
  ],
  "calculatedFields": [
    {
      "caption": "Rows Displayed",
      "fieldName": "[Rank Sort Measure (copy)]",
      "dataType": "integer",
      "role": "measure",
      "formula": "10",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": []
    },
    {
      "caption": "Rank Sort Measure",
      "fieldName": "[Total Orders Parameter]",
      "dataType": "string",
      "role": "measure",
      "formula": "\"Order $ (Decending)\"",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": []
    },
    {
      "caption": "Base Part",
      "fieldName": "[Base Part Number (copy)_1441996317229887488]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Base Part Number]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Base Part Number"
      ]
    },
    {
      "caption": "Rank",
      "fieldName": "[Calculation1]",
      "dataType": "integer",
      "role": "measure",
      "formula": "RANK( SUM([Measure for Rank]))",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Measure for Rank"
      ]
    },
    {
      "caption": "Order $ (Percent of Total)",
      "fieldName": "[Calculation2]",
      "dataType": "real",
      "role": "measure",
      "formula": "SUM([Order $]) / TOTAL(SUM([Order $]))",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Order $"
      ]
    },
    {
      "caption": "Calculation3",
      "fieldName": "[Calculation3]",
      "dataType": "real",
      "role": "measure",
      "formula": "SUM([Order $]) / TOTAL(SUM([Order $]))",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Order $"
      ]
    },
    {
      "caption": "Master Style",
      "fieldName": "[Calculation_107241981451685888]",
      "dataType": "string",
      "role": "dimension",
      "formula": "LEFT([Style Code],8)",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Style Code"
      ]
    },
    {
      "caption": "Style Count",
      "fieldName": "[Calculation_1130403519024861186]",
      "dataType": "integer",
      "role": "measure",
      "formula": "CountD([Master Style])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Master Style"
      ]
    },
    {
      "caption": "Region",
      "fieldName": "[Calculation_1141381037522870273]",
      "dataType": "string",
      "role": "dimension",
      "formula": "IF [Sales Area] = \"Canada\" THEN \"Canada\" ELSEIF \r\n[Sales Area] = \"United States of America\" THEN \"USA\" ELSE [Macro Area] END",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Sales Area",
        "Macro Area"
      ]
    },
    {
      "caption": "Measure for Rank",
      "fieldName": "[Calculation_1141381037533011970]",
      "dataType": "real",
      "role": "measure",
      "formula": "Case [Rank Sort Measure]\r\nWHEN \"Order $ (Accending)\" THEN -[Order $]\r\nWHEN \"Order Units (Accending)\" THEN -[Order Quantity]\r\nWHEN \"Order $ (Decending)\" THEN [Order $]\r\nWHEN \"Order Units (Decending)\" THEN [Order Quantity]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Rank Sort Measure",
        "Order $",
        "Order Quantity"
      ]
    },
    {
      "caption": "Base Style Name",
      "fieldName": "[Calculation_1163617556994338816]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Base Style]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Base Style"
      ]
    },
    {
      "caption": "Global",
      "fieldName": "[Calculation_1216534858663731200]",
      "dataType": "string",
      "role": "dimension",
      "formula": "\"Global\"",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": []
    },
    {
      "caption": "Delivery Season ",
      "fieldName": "[Calculation_1441996317233557505]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Delivery Season]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Delivery Season"
      ]
    },
    {
      "caption": "Delivery Month ",
      "fieldName": "[Calculation_1441996317233729538]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Delivery Month]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Delivery Month"
      ]
    },
    {
      "caption": "Rank Filter",
      "fieldName": "[Calculation_154248294240215040]",
      "dataType": "string",
      "role": "measure",
      "formula": "IF [Rank] <= [Rows Displayed] THEN \"Yes\" ELSE \"No\" END",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Rank",
        "Rows Displayed"
      ]
    },
    {
      "caption": "Order $ (U.S. Dealer Net)",
      "fieldName": "[Order $ (At U.S. Dealer Net) (copy)_1441996317248622595]",
      "dataType": "real",
      "role": "measure",
      "formula": "[Order $]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Order $"
      ]
    },
    {
      "caption": "Category",
      "fieldName": "[Product Category (copy)_717479722672918531]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Product Category]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Product Category"
      ]
    },
    {
      "caption": "Family",
      "fieldName": "[Product Family (copy)_717479722672955396]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Product Family]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Product Family"
      ]
    },
    {
      "caption": "Gender",
      "fieldName": "[Product Gender (copy)_717479722672988165]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Product Gender]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Product Gender"
      ]
    },
    {
      "caption": "Sub-Family",
      "fieldName": "[Product Sub-Family (copy)_717479722673156102]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Product Sub-Family]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Product Sub-Family"
      ]
    },
    {
      "caption": "Rank (Order $)",
      "fieldName": "[Rank (copy)_717479722655850496]",
      "dataType": "integer",
      "role": "measure",
      "formula": "RANK( SUM([Order $]))",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Order $"
      ]
    },
    {
      "caption": "Region ",
      "fieldName": "[Region (copy)_717479722672566273]",
      "dataType": "string",
      "role": "dimension",
      "formula": "IF [Sales Area] = \"Canada\" THEN \"Canada\" ELSEIF \r\n[Sales Area] = \"United States of America\" THEN \"USA\" ELSE [Macro Area] END",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Sales Area",
        "Macro Area"
      ]
    },
    {
      "caption": "Sales Area ",
      "fieldName": "[Sales Area (copy)_717479722672656386]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Sales Area]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Sales Area"
      ]
    },
    {
      "caption": "Style Code ",
      "fieldName": "[Style Code (copy)_717479722673266695]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Style Code]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Style Code"
      ]
    },
    {
      "caption": "Style Description ",
      "fieldName": "[Style Description (copy)_717479722673373192]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Style Description]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Style Description"
      ]
    }
  ],
  "parameters": [
    {
      "name": "Rows Displayed",
      "internalName": "[Rank Sort Measure (copy)]",
      "dataType": "integer",
      "domainType": "list",
      "default": "10",
      "values": [
        "5",
        "10",
        "20",
        "50",
        "10000"
      ],
      "range": null,
      "format": null
    },
    {
      "name": "Rank Sort Measure",
      "internalName": "[Total Orders Parameter]",
      "dataType": "string",
      "domainType": "list",
      "default": "\"Order $ (Decending)\"",
      "values": [
        "\"Order $ (Decending)\"",
        "\"Order Units (Decending)\"",
        "\"Order $ (Accending)\"",
        "\"Order Units (Accending)\""
      ],
      "range": null,
      "format": null
    }
  ],
  "worksheets": [
    {
      "name": "Data",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Delivery Season:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Calculation_1216534858663731200:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Garment Type:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Gender (copy)_717479722672988165:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category (copy)_717479722672918531:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Family (copy)_717479722672955396:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Sub-Family (copy)_717479722673156102:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Calculation_1163617556994338816:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Style Code (copy)_717479722673266695:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Style Description (copy)_717479722673373192:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Color:nk]",
        "[federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Collection:nk])))))))))))"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Base Part",
      "valueField": "Order $ (U.S. Dealer Net)",
      "categoryDateLevel": null,
      "dimensions": [
        "Base Part",
        "Base Style Name",
        "Global",
        "Collection",
        "Color",
        "Delivery Month",
        "Delivery Season",
        "Garment Type",
        "Category",
        "Family",
        "Gender",
        "Sub-Family",
        "Region ",
        "Sales Area ",
        "Style Code ",
        "Style Description ",
        "Style Description"
      ],
      "values": [
        "Order $ (U.S. Dealer Net)",
        "Order $ (MSRP)",
        "Order Quantity"
      ],
      "measures": [
        {
          "field": "Order $ (U.S. Dealer Net)",
          "agg": "SUM",
          "column": "Order $ (At U.S. Dealer Net) (copy)_1441996317248622595"
        },
        {
          "field": "Order $ (MSRP)",
          "agg": "SUM",
          "column": "Order $ (MSRP)"
        },
        {
          "field": "Order Quantity",
          "agg": "SUM",
          "column": "Order Quantity"
        }
      ],
      "axes": {
        "category": "Base Part",
        "categoryLevel": null,
        "values": [
          "Order $ (U.S. Dealer Net)",
          "Order $ (MSRP)",
          "Order Quantity"
        ],
        "orientation": null
      },
      "orientation": null,
      "caption": null,
      "title": null,
      "filters": [
        "Delivery Season",
        "Region ",
        "Sales Area ",
        "Garment Type",
        "Gender",
        "Category",
        "Family",
        "Sub-Family",
        "Delivery Month",
        "Style Description",
        "Base Part",
        "Base Style Name"
      ],
      "filterDetails": [
        {
          "field": "Base Part",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Base Style Name",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Delivery Month",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Delivery Season",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Garment Type",
          "filterClass": "categorical",
          "scope": "include",
          "values": [
            "Casual",
            "Functional"
          ],
          "range": null
        },
        {
          "field": "Category",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Family",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Gender",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Sub-Family",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Region ",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Sales Area ",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Style Description",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": true,
        "markColor": null,
        "background": null,
        "fontName": null,
        "fontSize": null,
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "Launch Summary ",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[sum:Order $:qk",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": null,
      "valueField": "Order $",
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [
        "Order $"
      ],
      "measures": [
        {
          "field": "Order $",
          "agg": "SUM",
          "column": "Order $"
        }
      ],
      "axes": {
        "category": null,
        "categoryLevel": null,
        "values": [
          "Order $"
        ],
        "orientation": null
      },
      "orientation": null,
      "caption": null,
      "title": "Order $ (USD)",
      "filters": [],
      "filterDetails": [],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true,
        "markColor": null,
        "background": null,
        "fontName": "Tableau Bold",
        "fontSize": "14",
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "card"
    },
    {
      "name": "Launch Summary (Slide)",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[sum:Order $:qk",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Garment Type",
      "valueField": "Order $",
      "categoryDateLevel": null,
      "dimensions": [
        "Garment Type",
        "Category",
        "Gender"
      ],
      "values": [
        "Order $"
      ],
      "measures": [
        {
          "field": "Order $",
          "agg": "SUM",
          "column": "Order $"
        }
      ],
      "axes": {
        "category": "Garment Type",
        "categoryLevel": null,
        "values": [
          "Order $"
        ],
        "orientation": null
      },
      "orientation": null,
      "caption": null,
      "title": "Order $ (USD)",
      "filters": [
        "Category",
        "Garment Type",
        "Gender"
      ],
      "filterDetails": [
        {
          "field": "Garment Type",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Category",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Gender",
          "filterClass": "categorical",
          "scope": null,
          "values": null,
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true,
        "markColor": null,
        "background": null,
        "fontName": "Tableau Bold",
        "fontSize": "14",
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "barChart"
    },
    {
      "name": "Launch Summary - Category",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Macro Area",
      "valueField": "Order $",
      "categoryDateLevel": null,
      "dimensions": [
        "Macro Area",
        "Product Category"
      ],
      "values": [
        "Order $",
        "Style Count"
      ],
      "measures": [
        {
          "field": "Order $",
          "agg": "SUM",
          "column": "Order $"
        },
        {
          "field": "Style Count",
          "agg": "SUM",
          "column": "Calculation_1130403519024861186"
        }
      ],
      "axes": {
        "category": "Macro Area",
        "categoryLevel": null,
        "values": [
          "Order $",
          "Style Count"
        ],
        "orientation": null
      },
      "orientation": null,
      "caption": null,
      "title": "Category",
      "filters": [
        "Macro Area"
      ],
      "filterDetails": [
        {
          "field": "Macro Area",
          "filterClass": "categorical",
          "scope": "exclude",
          "values": [
            "%null%"
          ],
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true,
        "markColor": null,
        "background": null,
        "fontName": "Tableau Bold",
        "fontSize": null,
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "Launch Summary - Category  - 3",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Delivery Season",
      "valueField": "Order $",
      "categoryDateLevel": null,
      "dimensions": [
        "Delivery Season",
        "Macro Area",
        "Product Category"
      ],
      "values": [
        "Order $",
        "Style Count"
      ],
      "measures": [
        {
          "field": "Order $",
          "agg": "SUM",
          "column": "Order $"
        },
        {
          "field": "Style Count",
          "agg": "SUM",
          "column": "Calculation_1130403519024861186"
        }
      ],
      "axes": {
        "category": "Delivery Season",
        "categoryLevel": null,
        "values": [
          "Order $",
          "Style Count"
        ],
        "orientation": null
      },
      "orientation": null,
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "filterDetails": [
        {
          "field": "Delivery Season",
          "filterClass": "categorical",
          "scope": "include",
          "values": [
            "2021   Jan Replenish",
            "2022   Summer"
          ],
          "range": null
        },
        {
          "field": "Macro Area",
          "filterClass": "categorical",
          "scope": "exclude",
          "values": [
            "%null%"
          ],
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true,
        "markColor": null,
        "background": null,
        "fontName": "Tableau Bold",
        "fontSize": null,
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "Launch Summary - Category (Slide)",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Macro Area",
      "valueField": "Order $",
      "categoryDateLevel": null,
      "dimensions": [
        "Macro Area",
        "Product Category"
      ],
      "values": [
        "Order $",
        "Style Count"
      ],
      "measures": [
        {
          "field": "Order $",
          "agg": "SUM",
          "column": "Order $"
        },
        {
          "field": "Style Count",
          "agg": "SUM",
          "column": "Calculation_1130403519024861186"
        }
      ],
      "axes": {
        "category": "Macro Area",
        "categoryLevel": null,
        "values": [
          "Order $",
          "Style Count"
        ],
        "orientation": null
      },
      "orientation": null,
      "caption": null,
      "title": "Category",
      "filters": [
        "Macro Area"
      ],
      "filterDetails": [
        {
          "field": "Macro Area",
          "filterClass": "categorical",
          "scope": "exclude",
          "values": [
            "%null%"
          ],
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true,
        "markColor": null,
        "background": null,
        "fontName": "Tableau Bold",
        "fontSize": null,
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "Launch Summary - Category - 1",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Delivery Season",
      "valueField": "Order $",
      "categoryDateLevel": null,
      "dimensions": [
        "Delivery Season",
        "Macro Area",
        "Product Category"
      ],
      "values": [
        "Order $",
        "Style Count"
      ],
      "measures": [
        {
          "field": "Order $",
          "agg": "SUM",
          "column": "Order $"
        },
        {
          "field": "Style Count",
          "agg": "SUM",
          "column": "Calculation_1130403519024861186"
        }
      ],
      "axes": {
        "category": "Delivery Season",
        "categoryLevel": null,
        "values": [
          "Order $",
          "Style Count"
        ],
        "orientation": null
      },
      "orientation": null,
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "filterDetails": [
        {
          "field": "Delivery Season",
          "filterClass": "categorical",
          "scope": "include",
          "values": [
            "2021   July Replenish"
          ],
          "range": null
        },
        {
          "field": "Macro Area",
          "filterClass": "categorical",
          "scope": "exclude",
          "values": [
            "%null%"
          ],
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true,
        "markColor": null,
        "background": null,
        "fontName": "Tableau Bold",
        "fontSize": null,
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "Launch Summary - Category - 2",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Delivery Season",
      "valueField": "Order $",
      "categoryDateLevel": null,
      "dimensions": [
        "Delivery Season",
        "Macro Area",
        "Product Category"
      ],
      "values": [
        "Order $",
        "Style Count"
      ],
      "measures": [
        {
          "field": "Order $",
          "agg": "SUM",
          "column": "Order $"
        },
        {
          "field": "Style Count",
          "agg": "SUM",
          "column": "Calculation_1130403519024861186"
        }
      ],
      "axes": {
        "category": "Delivery Season",
        "categoryLevel": null,
        "values": [
          "Order $",
          "Style Count"
        ],
        "orientation": null
      },
      "orientation": null,
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "filterDetails": [
        {
          "field": "Delivery Season",
          "filterClass": "categorical",
          "scope": "include",
          "values": [
            "2022   Spring"
          ],
          "range": null
        },
        {
          "field": "Macro Area",
          "filterClass": "categorical",
          "scope": "exclude",
          "values": [
            "%null%"
          ],
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true,
        "markColor": null,
        "background": null,
        "fontName": "Tableau Bold",
        "fontSize": null,
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "Launch Summary - Category - 4",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Delivery Season",
      "valueField": "Order $",
      "categoryDateLevel": null,
      "dimensions": [
        "Delivery Season",
        "Macro Area",
        "Product Category"
      ],
      "values": [
        "Order $",
        "Style Count"
      ],
      "measures": [
        {
          "field": "Order $",
          "agg": "SUM",
          "column": "Order $"
        },
        {
          "field": "Style Count",
          "agg": "SUM",
          "column": "Calculation_1130403519024861186"
        }
      ],
      "axes": {
        "category": "Delivery Season",
        "categoryLevel": null,
        "values": [
          "Order $",
          "Style Count"
        ],
        "orientation": null
      },
      "orientation": null,
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "filterDetails": [
        {
          "field": "Delivery Season",
          "filterClass": "categorical",
          "scope": "include",
          "values": [
            "2021   Fall",
            "2021   Winter"
          ],
          "range": null
        },
        {
          "field": "Macro Area",
          "filterClass": "categorical",
          "scope": "exclude",
          "values": [
            "%null%"
          ],
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true,
        "markColor": null,
        "background": null,
        "fontName": "Tableau Bold",
        "fontSize": null,
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "Launch Summary - Color",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Color:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Color",
      "valueField": "Order $",
      "categoryDateLevel": null,
      "dimensions": [
        "Color",
        "Macro Area"
      ],
      "values": [
        "Order $",
        "Style Count"
      ],
      "measures": [
        {
          "field": "Order $",
          "agg": "SUM",
          "column": "Order $"
        },
        {
          "field": "Style Count",
          "agg": "SUM",
          "column": "Calculation_1130403519024861186"
        }
      ],
      "axes": {
        "category": "Color",
        "categoryLevel": null,
        "values": [
          "Order $",
          "Style Count"
        ],
        "orientation": null
      },
      "orientation": null,
      "caption": null,
      "title": "Category",
      "filters": [
        "Macro Area"
      ],
      "filterDetails": [
        {
          "field": "Macro Area",
          "filterClass": "categorical",
          "scope": "exclude",
          "values": [
            "%null%"
          ],
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true,
        "markColor": null,
        "background": null,
        "fontName": "Tableau Bold",
        "fontSize": null,
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "Launch Summary - Delivery Season",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Calculation_1441996317233557505:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Delivery Season ",
      "valueField": "Order $",
      "categoryDateLevel": null,
      "dimensions": [
        "Delivery Season ",
        "Macro Area"
      ],
      "values": [
        "Order $",
        "Style Count"
      ],
      "measures": [
        {
          "field": "Order $",
          "agg": "SUM",
          "column": "Order $"
        },
        {
          "field": "Style Count",
          "agg": "SUM",
          "column": "Calculation_1130403519024861186"
        }
      ],
      "axes": {
        "category": "Delivery Season ",
        "categoryLevel": null,
        "values": [
          "Order $",
          "Style Count"
        ],
        "orientation": null
      },
      "orientation": null,
      "caption": null,
