{
  "irVersion": "1.0",
  "workbook": {
    "name": "(Active) 2021 Q3 Dealer Buying Event",
    "pascalName": "Active2021Q3DealerBuyingEvent",
    "sourcePath": "Data/Q3 Buyer/(Active) 2021 Q3 Dealer Buying Event.twb",
    "version": "18.1",
    "platform": ""
  },
  "dataSources": [
    {
      "name": "Sheet1 (Launch Data)",
      "internalName": "federated.117jb1u1i0ngbn1ed54pj0xj96lf",
      "connectionClass": "excel-direct",
      "sourceType": "Excel",
      "files": [
        "C:/Users/jagerb/Desktop/Q3 Launch Data.xlsx"
      ],
      "server": "",
      "database": null,
      "schema": null,
      "tables": [
        "Sheet1$",
        "Extract].[Extract"
      ],
      "active": true
    }
  ],
  "columns": [
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Item Code",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 0
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Delivery Month",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 1
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Base Part Number",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 2
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Macro Area",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 3
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Sales Area",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 4
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Micro Area",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 5
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Year",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 6
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Month",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 7
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Date",
      "caption": null,
      "dataType": "date",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 8
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Sum of Quantity (Units)",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 9
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Sum of Extra Quantity (Units)",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 10
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Order Quantity",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 11
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Cost",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 12
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Dnet",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 13
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "MSRP",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 14
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Product Cost $",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 15
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Order $",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 16
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Order $ (MSRP)",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 17
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Margin $",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 18
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Style",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 19
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Style Code",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 20
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Style Description",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 21
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Reorder Type",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 22
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Garment Type",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 23
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Product Gender",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 24
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Product Category",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 25
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Product Family",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 26
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Product Sub-Family",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 27
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Collection",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 28
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Delivery Season",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 29
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Delivery Date",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 30
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Gender/Stature/Type",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 31
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Base Style",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 32
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": "Color",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 33
    },
    {
      "datasource": "Sheet1 (Launch Data)",
      "name": ":Measure Names",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": null
    }
  ],
  "calculatedFields": [
    {
      "caption": "Rows Displayed",
      "fieldName": "[Rank Sort Measure (copy)]",
      "dataType": "integer",
      "role": "measure",
      "formula": "10",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Rank Sort Measure",
      "fieldName": "[Total Orders Parameter]",
      "dataType": "string",
      "role": "measure",
      "formula": "\"Order $ (Decending)\"",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Base Part",
      "fieldName": "[Base Part Number (copy)_1441996317229887488]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Base Part Number]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Rank",
      "fieldName": "[Calculation1]",
      "dataType": "integer",
      "role": "measure",
      "formula": "RANK( SUM([Calculation_1141381037533011970]))",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Order $ (Percent of Total)",
      "fieldName": "[Calculation2]",
      "dataType": "real",
      "role": "measure",
      "formula": "SUM([Order $]) / TOTAL(SUM([Order $]))",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Calculation3",
      "fieldName": "[Calculation3]",
      "dataType": "real",
      "role": "measure",
      "formula": "SUM([Order $]) / TOTAL(SUM([Order $]))",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Master Style",
      "fieldName": "[Calculation_107241981451685888]",
      "dataType": "string",
      "role": "dimension",
      "formula": "LEFT([Style Code],8)",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Style Count",
      "fieldName": "[Calculation_1130403519024861186]",
      "dataType": "integer",
      "role": "measure",
      "formula": "CountD([Calculation_107241981451685888])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Region",
      "fieldName": "[Calculation_1141381037522870273]",
      "dataType": "string",
      "role": "dimension",
      "formula": "IF [Sales Area] = \"Canada\" THEN \"Canada\" ELSEIF \r\n[Sales Area] = \"United States of America\" THEN \"USA\" ELSE [Macro Area] END",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Measure for Rank",
      "fieldName": "[Calculation_1141381037533011970]",
      "dataType": "real",
      "role": "measure",
      "formula": "Case [Parameters].[Total Orders Parameter]\r\nWHEN \"Order $ (Accending)\" THEN -[Order $]\r\nWHEN \"Order Units (Accending)\" THEN -[Order Quantity]\r\nWHEN \"Order $ (Decending)\" THEN [Order $]\r\nWHEN \"Order Units (Decending)\" THEN [Order Quantity]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Base Style Name",
      "fieldName": "[Calculation_1163617556994338816]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Base Style]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Global",
      "fieldName": "[Calculation_1216534858663731200]",
      "dataType": "string",
      "role": "dimension",
      "formula": "\"Global\"",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Delivery Season ",
      "fieldName": "[Calculation_1441996317233557505]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Delivery Season]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Delivery Month ",
      "fieldName": "[Calculation_1441996317233729538]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Delivery Month]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Rank Filter",
      "fieldName": "[Calculation_154248294240215040]",
      "dataType": "string",
      "role": "measure",
      "formula": "IF [Calculation1] <= [Parameters].[Rank Sort Measure (copy)] THEN \"Yes\" ELSE \"No\" END",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Order $ (U.S. Dealer Net)",
      "fieldName": "[Order $ (At U.S. Dealer Net) (copy)_1441996317248622595]",
      "dataType": "real",
      "role": "measure",
      "formula": "[Order $]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Category",
      "fieldName": "[Product Category (copy)_717479722672918531]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Product Category]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Family",
      "fieldName": "[Product Family (copy)_717479722672955396]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Product Family]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Gender",
      "fieldName": "[Product Gender (copy)_717479722672988165]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Product Gender]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Sub-Family",
      "fieldName": "[Product Sub-Family (copy)_717479722673156102]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Product Sub-Family]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Rank (Order $)",
      "fieldName": "[Rank (copy)_717479722655850496]",
      "dataType": "integer",
      "role": "measure",
      "formula": "RANK( SUM([Order $]))",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Region ",
      "fieldName": "[Region (copy)_717479722672566273]",
      "dataType": "string",
      "role": "dimension",
      "formula": "IF [Sales Area] = \"Canada\" THEN \"Canada\" ELSEIF \r\n[Sales Area] = \"United States of America\" THEN \"USA\" ELSE [Macro Area] END",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Sales Area ",
      "fieldName": "[Sales Area (copy)_717479722672656386]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Sales Area]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Style Code ",
      "fieldName": "[Style Code (copy)_717479722673266695]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Style Code]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Style Description ",
      "fieldName": "[Style Description (copy)_717479722673373192]",
      "dataType": "string",
      "role": "dimension",
      "formula": "[Style Description]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    }
  ],
  "parameters": [
    {
      "name": "Rows Displayed",
      "internalName": "[Rank Sort Measure (copy)]",
      "dataType": "integer",
      "domainType": "list",
      "default": "10",
      "values": [
        "5",
        "10",
        "20",
        "50",
        "10000"
      ],
      "range": null,
      "format": null
    },
    {
      "name": "Rank Sort Measure",
      "internalName": "[Total Orders Parameter]",
      "dataType": "string",
      "domainType": "list",
      "default": "\"Order $ (Decending)\"",
      "values": [
        "\"Order $ (Decending)\"",
        "\"Order Units (Decending)\"",
        "\"Order $ (Accending)\"",
        "\"Order Units (Accending)\""
      ],
      "range": null,
      "format": null
    }
  ],
  "worksheets": [
    {
      "name": "Data",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Delivery Season:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Calculation_1216534858663731200:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Garment Type:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Gender (copy)_717479722672988165:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category (copy)_717479722672918531:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Family (copy)_717479722672955396:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Sub-Family (copy)_717479722673156102:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Calculation_1163617556994338816:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Style Code (copy)_717479722673266695:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Style Description (copy)_717479722673373192:nk]",
        "([federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Color:nk]",
        "[federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Collection:nk])))))))))))"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Delivery Season",
        "Global",
        "Garment Type",
        "Gender",
        "Category",
        "Family",
        "Sub-Family",
        "Base Style Name",
        "Style Code ",
        "Style Description ",
        "Color",
        "Collection"
      ],
      "values": [],
      "caption": null,
      "title": null,
      "filters": [
        "Delivery Season",
        "Region ",
        "Sales Area ",
        "Garment Type",
        "Gender",
        "Category",
        "Family",
        "Sub-Family",
        "Delivery Month",
        "Style Description",
        "Base Part",
        "Base Style Name"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary ",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[sum:Order $:qk",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": null,
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [],
      "caption": null,
      "title": "Order $ (USD)",
      "filters": [],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": "card"
    },
    {
      "name": "Launch Summary (Slide)",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[sum:Order $:qk",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": null,
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [],
      "caption": null,
      "title": "Order $ (USD)",
      "filters": [
        "Category",
        "Garment Type",
        "Gender"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": "card"
    },
    {
      "name": "Launch Summary - Category",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Category"
      ],
      "values": [],
      "caption": null,
      "title": "Category",
      "filters": [
        "Macro Area"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Category  - 3",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Category"
      ],
      "values": [],
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Category (Slide)",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Category"
      ],
      "values": [],
      "caption": null,
      "title": "Category",
      "filters": [
        "Macro Area"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Category - 1",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Category"
      ],
      "values": [],
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Category - 2",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Category"
      ],
      "values": [],
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Category - 4",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Category:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Category"
      ],
      "values": [],
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Color",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Color:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Color"
      ],
      "values": [],
      "caption": null,
      "title": "Category",
      "filters": [
        "Macro Area"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Delivery Season",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Calculation_1441996317233557505:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Delivery Season "
      ],
      "values": [],
      "caption": null,
      "title": "Delivery Season",
      "filters": [
        "Macro Area"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Delivery Season (Slide)",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Calculation_1441996317233557505:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Delivery Season "
      ],
      "values": [],
      "caption": null,
      "title": "Delivery Season",
      "filters": [
        "Macro Area",
        "Category",
        "Garment Type",
        "Gender"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Family",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Family:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Family"
      ],
      "values": [],
      "caption": null,
      "title": "Family",
      "filters": [
        "Macro Area"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Family (Slide)",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Family:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Family"
      ],
      "values": [],
      "caption": null,
      "title": "Family",
      "filters": [
        "Macro Area",
        "Category",
        "Gender",
        "Garment Type"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Garment Type",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Garment Type:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Garment Type"
      ],
      "values": [],
      "caption": null,
      "title": "Garment Type",
      "filters": [
        "Macro Area"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Garment Type - 1",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Garment Type:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Garment Type"
      ],
      "values": [],
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Garment Type - 2",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Garment Type:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Garment Type"
      ],
      "values": [],
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Garment Type - 3",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Garment Type:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Garment Type"
      ],
      "values": [],
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Garment Type - 4",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Garment Type:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Garment Type"
      ],
      "values": [],
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Garment Type Slide)",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Garment Type:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Garment Type"
      ],
      "values": [],
      "caption": null,
      "title": "Garment Type",
      "filters": [
        "Macro Area"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Gender",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Gender:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Gender"
      ],
      "values": [],
      "caption": null,
      "title": "Gender",
      "filters": [
        "Macro Area"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Gender  - 3",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Gender:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Gender"
      ],
      "values": [],
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Gender (Slide)",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Gender:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Gender"
      ],
      "values": [],
      "caption": null,
      "title": "Gender",
      "filters": [
        "Macro Area"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Gender - 1",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Gender:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Gender"
      ],
      "values": [],
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Gender - 2",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Gender:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Gender"
      ],
      "values": [],
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - Gender - 4",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Product Gender:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Product Gender"
      ],
      "values": [],
      "caption": null,
      "title": "Region",
      "filters": [
        "Macro Area",
        "Delivery Season"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Launch Summary - MacroArea",
      "datasource": "Sheet1 (Launch Data)",
      "markClass": "Automatic",
      "rows": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[none:Calculation_1141381037522870273:nk"
      ],
      "cols": [
        "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.117jb1u1i0ngbn1ed54pj0xj96lf].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Region"
      ],
      "values": [],
      "caption": null,
