{
  "irVersion": "1.0",
  "workbook": {
    "name": "Sales & Customer Dashboards",
    "pascalName": "SalesCustomerDashboards",
    "sourcePath": "Data/Sales and Customer/Sales & Customer Dashboards.twb",
    "version": "18.1",
    "platform": ""
  },
  "dataSources": [
    {
      "name": "Sales DataSource",
      "internalName": "federated.1kpxa041aiai2y1cl4pui1t4eju9",
      "connectionClass": "textscan",
      "sourceType": "CSV",
      "files": [
        "Customers.csv",
        "C:/Users/AmanRajMAQSoftware/Downloads/Sales and Customer Dashboards/datasets/eu"
      ],
      "server": "",
      "database": null,
      "schema": null,
      "tables": [
        "Orders#csv",
        "Customers#csv",
        "Location#csv",
        "Products#csv",
        "Extract].[Orders.csv_905AF3F5FECA431C80766E0C0C188760",
        "Extract].[Customers.csv_6DC64CBD7A91476C8367C3011943FE6B",
        "Extract].[Location.csv_DF4EAC7E83794D459E9117839A9D605A",
        "Extract].[Products.csv_62ED95945D1146228C3236829E70736C"
      ],
      "active": true
    }
  ],
  "columns": [
    {
      "datasource": "Sales DataSource",
      "name": "Row ID",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 0
    },
    {
      "datasource": "Sales DataSource",
      "name": "Order ID",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 1
    },
    {
      "datasource": "Sales DataSource",
      "name": "Order Date",
      "caption": null,
      "dataType": "date",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 2
    },
    {
      "datasource": "Sales DataSource",
      "name": "Ship Date",
      "caption": null,
      "dataType": "date",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 3
    },
    {
      "datasource": "Sales DataSource",
      "name": "Ship Mode",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 4
    },
    {
      "datasource": "Sales DataSource",
      "name": "Customer ID",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 5
    },
    {
      "datasource": "Sales DataSource",
      "name": "Segment",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 6
    },
    {
      "datasource": "Sales DataSource",
      "name": "Postal Code",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 7
    },
    {
      "datasource": "Sales DataSource",
      "name": "Product ID",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 8
    },
    {
      "datasource": "Sales DataSource",
      "name": "Sales",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 9
    },
    {
      "datasource": "Sales DataSource",
      "name": "Quantity",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 10
    },
    {
      "datasource": "Sales DataSource",
      "name": "Discount",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 11
    },
    {
      "datasource": "Sales DataSource",
      "name": "Profit",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 12
    },
    {
      "datasource": "Sales DataSource",
      "name": "Customer Name",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 14
    },
    {
      "datasource": "Sales DataSource",
      "name": "City",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 16
    },
    {
      "datasource": "Sales DataSource",
      "name": "State",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 17
    },
    {
      "datasource": "Sales DataSource",
      "name": "Region",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 18
    },
    {
      "datasource": "Sales DataSource",
      "name": "Country/Region",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 19
    },
    {
      "datasource": "Sales DataSource",
      "name": "Category",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 21
    },
    {
      "datasource": "Sales DataSource",
      "name": "Sub-Category",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 22
    },
    {
      "datasource": "Sales DataSource",
      "name": "Product Name",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 23
    },
    {
      "datasource": "Sales DataSource",
      "name": "Postal Code (Location.csv)",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": "[ZipCode].[Name]",
      "format": null,
      "ordinal": 15
    }
  ],
  "calculatedFields": [
    {
      "caption": "Select Year",
      "fieldName": "[Parameter 1]",
      "dataType": "integer",
      "role": "measure",
      "formula": "2023",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "% Diff Orders",
      "fieldName": "[% Diff Customers (copy)_3221481164597477394]",
      "dataType": "real",
      "role": "measure",
      "formula": "(COUNTD([CY Sales (copy)_3221481164594982929]) - COUNTD([PY Sales (copy)_3221481164594888720])) / COUNTD([PY Sales (copy)_3221481164594888720])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "% Diff Customers",
      "fieldName": "[% Diff Quantity (copy)_3221481164588376075]",
      "dataType": "real",
      "role": "measure",
      "formula": "(COUNTD([CY Sales (copy)_3221481164532666369]) - COUNTD([CY Customers (copy)_3221481164533411843])) / COUNTD([CY Customers (copy)_3221481164533411843])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "% Diff Quantity",
      "fieldName": "[% Diff Sales (copy) (copy)_237846410425131013]",
      "dataType": "real",
      "role": "measure",
      "formula": "(SUM([CY Sales (copy) (copy)_237846410424193025]) - SUM([PY Sales (copy) (copy)_237846410424823811])) / SUM([PY Sales (copy) (copy)_237846410424823811])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "% Diff Profit",
      "fieldName": "[% Diff Sales (copy)_237846410425122820]",
      "dataType": "real",
      "role": "measure",
      "formula": "(SUM([CY Sales (copy)_237846410424180736]) - SUM([PY Sales (copy)_237846410424815618])) / SUM([CY Sales (copy)_237846410424180736])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "% Diff Sales per Customers",
      "fieldName": "[% Diff Sales (copy)_3221481164536066054]",
      "dataType": "real",
      "role": "measure",
      "formula": "([CY Profit (copy)_3221481164532895746] - [CY Sales per Customer (copy)_3221481164533485572]) / [CY Sales per Customer (copy)_3221481164533485572]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "PY Customers",
      "fieldName": "[CY Customers (copy)_3221481164533411843]",
      "dataType": "string",
      "role": "dimension",
      "formula": "IF YEAR([Order Date])= [Parameters].[Parameter 1]-1 THEN [Customer ID] \r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "CY Sales per Customer",
      "fieldName": "[CY Profit (copy)_3221481164532895746]",
      "dataType": "real",
      "role": "measure",
      "formula": "SUM([Calculation_721701895334993921]) / COUNTD([CY Sales (copy)_3221481164532666369])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "CY Quantity",
      "fieldName": "[CY Sales (copy) (copy)_237846410424193025]",
      "dataType": "integer",
      "role": "measure",
      "formula": "IF YEAR([Order Date]) = [Parameters].[Parameter 1] THEN [Quantity]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "CY Profit",
      "fieldName": "[CY Sales (copy)_237846410424180736]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF YEAR([Order Date]) = [Parameters].[Parameter 1] THEN [Profit]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "CY Customers",
      "fieldName": "[CY Sales (copy)_3221481164532666369]",
      "dataType": "string",
      "role": "dimension",
      "formula": "IF YEAR([Order Date])= [Parameters].[Parameter 1] THEN [Customer ID] \r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "CY Orders",
      "fieldName": "[CY Sales (copy)_3221481164594982929]",
      "dataType": "string",
      "role": "dimension",
      "formula": "IF YEAR([Order Date]) = [Parameters].[Parameter 1] THEN [Order ID]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "PY Sales",
      "fieldName": "[CY Sales (copy)_721701895335804930]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF YEAR([Order Date]) = [Parameters].[Parameter 1]-1 THEN [Sales]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "PY Sales per Customer",
      "fieldName": "[CY Sales per Customer (copy)_3221481164533485572]",
      "dataType": "real",
      "role": "measure",
      "formula": "SUM([CY Sales (copy)_721701895335804930]) / COUNTD([CY Customers (copy)_3221481164533411843])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Current Year",
      "fieldName": "[Calculation_1240741752607899648]",
      "dataType": "integer",
      "role": "dimension",
      "formula": "[Parameters].[Parameter 1]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Previous Year",
      "fieldName": "[Calculation_1240741752607936513]",
      "dataType": "integer",
      "role": "dimension",
      "formula": "[Parameters].[Parameter 1]-1",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "KPI CY Less PY",
      "fieldName": "[Calculation_2435040078806671369]",
      "dataType": "string",
      "role": "measure",
      "formula": "IF SUM([Calculation_721701895334993921]) < SUM([CY Sales (copy)_721701895335804930]) THEN '⬤'\r\nELSE ''\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "KPI Sales Avg",
      "fieldName": "[Calculation_2435040078825054219]",
      "dataType": "string",
      "role": "measure",
      "formula": "IF SUM([Calculation_721701895334993921]) > WINDOW_AVG(SUM([Calculation_721701895334993921]))\r\nTHEN 'Above'\r\nELSE 'Below'\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "CY Sales",
      "fieldName": "[Calculation_721701895334993921]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF YEAR([Order Date]) = [Parameters].[Parameter 1] THEN [Sales]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Order Date (Year)",
      "fieldName": "[Calculation_721701895336701956]",
      "dataType": "integer",
      "role": "measure",
      "formula": "YEAR([Order Date])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "% Diff Sales",
      "fieldName": "[Calculation_721701895340638217]",
      "dataType": "real",
      "role": "measure",
      "formula": "(SUM([Calculation_721701895334993921]) - SUM([CY Sales (copy)_721701895335804930])) / SUM([CY Sales (copy)_721701895335804930])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Min/Max Sales",
      "fieldName": "[Calculation_721701895347843083]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF SUM([Calculation_721701895334993921]) = WINDOW_MAX(SUM([Calculation_721701895334993921]))\r\nTHEN SUM([Calculation_721701895334993921])\r\nELSEIF SUM([Calculation_721701895334993921]) = WINDOW_MIN(SUM([Calculation_721701895334993921]))\r\nTHEN SUM([Calculation_721701895334993921])\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "{SUM([CY Sales])}",
      "fieldName": "[Calculation_721701895351046156]",
      "dataType": "real",
      "role": "measure",
      "formula": "{SUM([Calculation_721701895334993921])}",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Nr of Orders per Customers",
      "fieldName": "[Calculation_998110323739992064]",
      "dataType": "integer",
      "role": "dimension",
      "formula": "{ FIXED [CY Sales (copy)_3221481164532666369]: COUNTD([CY Sales (copy)_3221481164594982929])}",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "KPI Profit Avg",
      "fieldName": "[KPI Sales Avg (copy)_2435040078826737676]",
      "dataType": "string",
      "role": "measure",
      "formula": "IF SUM([CY Sales (copy)_237846410424180736]) > WINDOW_AVG(SUM([CY Sales (copy)_237846410424180736]))\r\nTHEN 'Above'\r\nELSE 'Below'\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Min/Max Sales Per Customers",
      "fieldName": "[Min/Max Quantity (copy)_3221481164537155591]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF [CY Profit (copy)_3221481164532895746] = WINDOW_MAX([CY Profit (copy)_3221481164532895746])\r\nTHEN [CY Profit (copy)_3221481164532895746] \r\nELSEIF [CY Profit (copy)_3221481164532895746] = WINDOW_MIN([CY Profit (copy)_3221481164532895746])\r\nTHEN [CY Profit (copy)_3221481164532895746]\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Min/Max Customers",
      "fieldName": "[Min/Max Quantity (copy)_3221481164588691468]",
      "dataType": "integer",
      "role": "measure",
      "formula": "IF COUNTD([CY Sales (copy)_3221481164532666369]) = WINDOW_MAX(COUNTD([CY Sales (copy)_3221481164532666369]))\r\nTHEN COUNTD([CY Sales (copy)_3221481164532666369])\r\nELSEIF COUNTD([CY Sales (copy)_3221481164532666369]) = WINDOW_MIN(COUNTD([CY Sales (copy)_3221481164532666369]))\r\nTHEN COUNTD([CY Sales (copy)_3221481164532666369])\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Min/Max Quantity",
      "fieldName": "[Min/Max Sales (copy) (copy)_237846410425856007]",
      "dataType": "integer",
      "role": "measure",
      "formula": "IF SUM([CY Sales (copy) (copy)_237846410424193025]) = WINDOW_MAX(SUM([CY Sales (copy) (copy)_237846410424193025]))\r\nTHEN SUM([CY Sales (copy) (copy)_237846410424193025])\r\nELSEIF SUM([CY Sales (copy) (copy)_237846410424193025]) = WINDOW_MIN(SUM([CY Sales (copy) (copy)_237846410424193025]))\r\nTHEN SUM([CY Sales (copy) (copy)_237846410424193025])\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Min/Max Profit",
      "fieldName": "[Min/Max Sales (copy)_237846410425847814]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF SUM([CY Sales (copy)_237846410424180736]) = WINDOW_MAX(SUM([CY Sales (copy)_237846410424180736]))\r\nTHEN SUM([CY Sales (copy)_237846410424180736])\r\nELSEIF SUM([CY Sales (copy)_237846410424180736]) = WINDOW_MIN(SUM([CY Sales (copy)_237846410424180736]))\r\nTHEN SUM([CY Sales (copy)_237846410424180736])\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Min/Max Orders",
      "fieldName": "[Min/Max Sales (copy)_3221481164601258003]",
      "dataType": "integer",
      "role": "measure",
      "formula": "IF COUNTD([CY Sales (copy)_3221481164594982929]) = WINDOW_MAX(COUNTD([CY Sales (copy)_3221481164594982929]))\r\nTHEN COUNTD([CY Sales (copy)_3221481164594982929])\r\nELSEIF COUNTD([CY Sales (copy)_3221481164594982929]) = WINDOW_MIN(COUNTD([CY Sales (copy)_3221481164594982929]))\r\nTHEN COUNTD([CY Sales (copy)_3221481164594982929])\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "PY Quantity",
      "fieldName": "[PY Sales (copy) (copy)_237846410424823811]",
      "dataType": "integer",
      "role": "measure",
      "formula": "IF YEAR([Order Date]) = [Parameters].[Parameter 1]-1 THEN [Quantity]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "PY Profit",
      "fieldName": "[PY Sales (copy)_237846410424815618]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF YEAR([Order Date]) = [Parameters].[Parameter 1]-1 THEN [Profit]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "PY Orders",
      "fieldName": "[PY Sales (copy)_3221481164594888720]",
      "dataType": "string",
      "role": "dimension",
      "formula": "IF YEAR([Order Date]) = [Parameters].[Parameter 1]-1 THEN [Order ID]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    }
  ],
  "parameters": [
    {
      "name": "Select Year",
      "internalName": "[Parameter 1]",
      "dataType": "integer",
      "domainType": "list",
      "default": "2023",
      "values": [
        "2020",
        "2021",
        "2022",
        "2023"
      ],
      "range": null,
      "format": "n0;-0"
    }
  ],
  "worksheets": [
    {
      "name": "Customer Distribution",
      "datasource": "Sales DataSource",
      "markClass": "Bar",
      "rows": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[ctd:CY Sales (copy)_3221481164532666369:qk"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[none:Calculation_998110323739992064:ok"
      ],
      "encodings": {
        "color": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[ctd:CY Sales (copy)_3221481164532666369:qk",
        "size": null,
        "text": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[ctd:CY Sales (copy)_3221481164532666369:qk",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Nr of Orders per Customers",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        "Nr of Orders per Customers",
        "CY Customers"
      ],
      "values": [],
      "caption": null,
      "title": null,
      "filters": [
        "Category",
        "City",
        "Region",
        "State",
        "Sub-Category"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#f1f1f1",
          "#d9e8ed",
          "#c2e0ea",
          "#abd7e7",
          "#95cfe3",
          "#7fc7e0",
          "#6abfdd",
          "#56b8d9",
          "#42b0d6",
          "#2fa9d3",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": false,
        "markStroke": "#333333",
        "showMarkLabels": true
      },
      "inferredVisualType": "barChart"
    },
    {
      "name": "KPI Customers",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Min",
        "Max Quantity (copy)_3221481164588691468:qk])"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[mn:Order Date:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:Calculation_3221481164589563917:qk",
        "label": null,
        "tooltip": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[attr:Calculation_1240741752607899648:qk",
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Order Date",
      "valueField": null,
      "categoryDateLevel": "month",
      "dimensions": [
        "Order Date",
        "usr:Min",
        "Max Quantity (copy)_3221481164588691468:qk"
      ],
      "values": [],
      "caption": null,
      "title": "Total Customers\n{value}\n{value}  vs. PY",
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#ff5500",
          "#f86e29",
          "#f28650",
          "#ec9d76",
          "#e5b299",
          "#dfc6ba",
          "#d9d9d9",
          "#b8cfd7",
          "#98c6d6",
          "#79bdd4",
          "#59b3d3",
          "#3baad1",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": false
      },
      "inferredVisualType": null
    },
    {
      "name": "KPI Orders",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Min",
        "Max Sales (copy)_3221481164601258003:qk])"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[mn:Order Date:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:Calculation_3221481164605767702:qk",
        "label": null,
        "tooltip": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[attr:Calculation_1240741752607899648:qk",
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Order Date",
      "valueField": null,
      "categoryDateLevel": "month",
      "dimensions": [
        "Order Date",
        "usr:Min",
        "Max Sales (copy)_3221481164601258003:qk"
      ],
      "values": [],
      "caption": null,
      "title": "Total Orders\n{value}\n{value}  vs. PY",
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#ff5500",
          "#f86e29",
          "#f28650",
          "#ec9d76",
          "#e5b299",
          "#dfc6ba",
          "#d9d9d9",
          "#b8cfd7",
          "#98c6d6",
          "#79bdd4",
          "#59b3d3",
          "#3baad1",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": false
      },
      "inferredVisualType": null
    },
    {
      "name": "KPI Profit",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Min",
        "Max Sales (copy)_237846410425847814:qk])"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[mn:Order Date:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[attr:Calculation_1240741752607899648:qk",
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Order Date",
      "valueField": null,
      "categoryDateLevel": "month",
      "dimensions": [
        "Order Date",
        "usr:Min",
        "Max Sales (copy)_237846410425847814:qk"
      ],
      "values": [],
      "caption": null,
      "title": "Total Profit\n{value}\n{value}  vs. PY",
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#ff5500",
          "#f86e29",
          "#f28650",
          "#ec9d76",
          "#e5b299",
          "#dfc6ba",
          "#d9d9d9",
          "#b8cfd7",
          "#98c6d6",
          "#79bdd4",
          "#59b3d3",
          "#3baad1",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": false
      },
      "inferredVisualType": null
    },
    {
      "name": "KPI Quantity",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Min",
        "Max Sales (copy) (copy)_237846410425856007:qk])"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[mn:Order Date:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:Calculation_237846410429689866:qk",
        "label": null,
        "tooltip": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[attr:Calculation_1240741752607899648:qk",
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Order Date",
      "valueField": null,
      "categoryDateLevel": "month",
      "dimensions": [
        "Order Date",
        "usr:Min",
        "Max Sales (copy) (copy)_237846410425856007:qk"
      ],
      "values": [],
      "caption": null,
      "title": "Total Quantity\n{value}\n{value}  vs. PY",
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#ff5500",
          "#f86e29",
          "#f28650",
          "#ec9d76",
          "#e5b299",
          "#dfc6ba",
          "#d9d9d9",
          "#b8cfd7",
          "#98c6d6",
          "#79bdd4",
          "#59b3d3",
          "#3baad1",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": false
      },
      "inferredVisualType": null
    },
    {
      "name": "KPI Sales",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Calculation_721701895347843083:qk])"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[mn:Order Date:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:Calculation_721701895351046156:qk",
        "label": null,
        "tooltip": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[attr:Calculation_1240741752607899648:qk",
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Order Date",
      "valueField": "Min/Max Sales",
      "categoryDateLevel": "month",
      "dimensions": [
        "Order Date"
      ],
      "values": [
        "Min/Max Sales",
        "{SUM([CY Sales])}"
      ],
      "caption": null,
      "title": "Total Sales\n{{SUM([CY Sales])}}\n{value}  vs. PY",
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#ff5500",
          "#f86e29",
          "#f28650",
          "#ec9d76",
          "#e5b299",
          "#dfc6ba",
          "#d9d9d9",
          "#b8cfd7",
          "#98c6d6",
          "#79bdd4",
          "#59b3d3",
          "#3baad1",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": false
      },
      "inferredVisualType": null
    },
    {
      "name": "KPI Sales Per Customers",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Min",
        "Max Quantity (copy)_3221481164537155591:qk])"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[mn:Order Date:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:Calculation_3221481164565110792:qk",
        "label": null,
        "tooltip": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[attr:Calculation_1240741752607899648:qk",
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Order Date",
      "valueField": null,
      "categoryDateLevel": "month",
      "dimensions": [
        "Order Date",
        "usr:Min",
        "Max Quantity (copy)_3221481164537155591:qk"
      ],
      "values": [],
      "caption": null,
      "title": "Total Sales Per Customers\n{value}\n{value}  vs. PY",
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#ff5500",
          "#f86e29",
          "#f28650",
          "#ec9d76",
          "#e5b299",
          "#dfc6ba",
          "#d9d9d9",
          "#b8cfd7",
          "#98c6d6",
          "#79bdd4",
          "#59b3d3",
          "#3baad1",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": false
      },
      "inferredVisualType": null
    },
    {
      "name": "Legend KPI",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[none:Calculation_1240741752607899648:ok",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": null,
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [],
      "caption": null,
      "title": null,
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": "card"
    },
    {
      "name": "Legend Subcategory",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[none:Calculation_1240741752607899648:ok",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": null,
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [],
      "caption": null,
      "title": null,
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": "card"
    },
    {
      "name": "Subcategory Comparison",
      "datasource": "Sales DataSource",
      "markClass": "Bar",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[none:Sub-Category:nk]",
        "[federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Calculation_2435040078806671369:nk])"
      ],
      "cols": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:CY Sales (copy)_721701895335804930:qk] + ([federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:Calculation_721701895334993921:qk] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:CY Sales (copy)_237846410424180736:qk]))"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:CY Sales (copy)_721701895335804930:qk",
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Sub-Category",
      "valueField": "KPI CY Less PY",
      "categoryDateLevel": null,
      "dimensions": [
        "Sub-Category"
      ],
      "values": [
        "KPI CY Less PY",
        "PY Sales",
        "PY Sales"
      ],
      "caption": null,
      "title": null,
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#ff5500",
          "#fb6316",
          "#f8702d",
          "#f47e42",
          "#f18a57",
          "#ed976c",
          "#eaa37f",
          "#e6ae92",
          "#e3baa5",
          "#dfc4b7",
          "#dccfc8",
          "#d9d9d9",
          "#c7d3d8",
          "#b5ced7",
          "#a4c9d6",
          "#92c4d5",
          "#81bfd4",
          "#70bad4",
          "#5fb5d3",
          "#4eb0d2",
          "#3eabd1",
          "#2da6d0",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": false
      },
      "inferredVisualType": "barChart"
    },
    {
      "name": "Test KPI",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[yr:Order Date:ok"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Order Date"
      ],
      "values": [],
      "caption": null,
      "title": null,
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Test KPI2",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[:Measure Names"
      ],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names"
      ],
      "values": [],
      "caption": null,
      "title": null,
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Test Max Min",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[mn:Order Date:ok"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Order Date"
      ],
      "values": [],
      "caption": null,
      "title": null,
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Top Customers",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Calculation_782500491678904334:ok]",
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[none:Customer Name:nk]",
        "[federated.1kpxa041aiai2y1cl4pui1t4eju9].[max:Order Date:ok]))"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[:Measure Names"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": ":Measure Names",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        ":Measure Names",
        "Calculation_782500491678904334",
        "Customer Name",
        "Order Date"
      ],
      "values": [],
      "caption": null,
      "title": null,
      "filters": [
        "Category",
        "City",
        "Region",
        "State",
        "Sub-Category",
        "Customer Name"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": null
    },
    {
      "name": "Weekly Trends",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:Calculation_721701895334993921:qk] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:CY Sales (copy)_237846410424180736:qk])"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[wk:Order Date:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[attr:Calculation_1240741752607899648:qk",
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Order Date",
      "valueField": "CY Sales",
      "categoryDateLevel": "week",
      "dimensions": [
        "Order Date"
      ],
      "values": [
        "CY Sales"
      ],
      "caption": null,
      "title": null,
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": false,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": null
      },
      "inferredVisualType": null
    }
  ],
  "dashboards": [
    {
      "name": "Customer Dashboard",
      "size": {
        "w": 1200,
        "h": 800
      },
      "title": null,
      "background": "#f5f5f5",
      "zones": [
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Customer Dashboard",
          "x": 6084,
          "y": 0,
          "w": 68334,
          "h": 7375
        },
        {
          "type": "viz",
          "worksheet": "Legend KPI",
          "field": null,
          "x": 0,
          "y": 7375,
          "w": 100000,
          "h": 3625
        },
        {
          "type": "viz",
          "worksheet": "KPI Customers",
          "field": null,
          "x": 0,
          "y": 11000,
          "w": 33333,
          "h": 35500
        },
        {
          "type": "viz",
          "worksheet": "KPI Sales Per Customers",
          "field": null,
          "x": 33333,
          "y": 11000,
          "w": 33334,
          "h": 35500
        },
        {
          "type": "viz",
          "worksheet": "KPI Orders",
          "field": null,
          "x": 66667,
          "y": 11000,
          "w": 33333,
          "h": 35500
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Customer Distribution by Nr. of Orders",
          "x": 1416,
          "y": 48625,
          "w": 47168,
          "h": 4250
        },
        {
          "type": "viz",
          "worksheet": "Customer Distribution",
          "field": null,
          "x": 1416,
          "y": 52875,
          "w": 47168,
          "h": 45000
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Top 10 Customers by Profit",
          "x": 51416,
          "y": 48625,
          "w": 47168,
          "h": 4250
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Rank",
          "x": 51416,
          "y": 52875,
          "w": 4417,
          "h": 5000
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Customers",
          "x": 55833,
          "y": 52875,
          "w": 10834,
          "h": 5000
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Last Order",
          "x": 66667,
          "y": 52875,
          "w": 9250,
          "h": 5000
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Profit",
          "x": 75917,
          "y": 52875,
          "w": 9000,
          "h": 5000
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Sales",
          "x": 84917,
          "y": 52875,
          "w": 8417,
          "h": 5000
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Orders",
          "x": 93334,
          "y": 52875,
          "w": 5250,
          "h": 5000
        },
        {
          "type": "viz",
          "worksheet": "Top Customers",
          "field": null,
          "x": 51416,
          "y": 57875,
          "w": 47168,
          "h": 40000
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "F I L T E R S",
          "x": 79333,
          "y": 12000,
          "w": 19751,
          "h": 4625
        },
        {
          "type": "paramctrl",
          "worksheet": null,
          "field": "Select Year",
          "x": 79333,
          "y": 16625,
          "w": 19751,
          "h": 6875
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "P R O D U C T",
          "x": 79333,
          "y": 23500,
          "w": 19751,
          "h": 4000
        },
        {
          "type": "filter",
          "worksheet": "KPI Customers",
          "field": "Category",
          "x": 79333,
          "y": 27500,
          "w": 19751,
          "h": 7125
        },
        {
          "type": "filter",
          "worksheet": "KPI Customers",
          "field": "Sub-Category",
          "x": 79333,
          "y": 34625,
          "w": 19751,
          "h": 7125
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "L O C A T I O N",
          "x": 79333,
          "y": 49250,
          "w": 19751,
          "h": 4000
        },
        {
          "type": "filter",
          "worksheet": "KPI Customers",
          "field": "Region",
          "x": 79333,
          "y": 53250,
          "w": 19751,
          "h": 7125
        },
        {
          "type": "filter",
          "worksheet": "KPI Customers",
          "field": "State",
          "x": 79333,
          "y": 60375,
          "w": 19751,
          "h": 7125
        },
        {
          "type": "filter",
          "worksheet": "KPI Customers",
          "field": "City",
          "x": 79333,
          "y": 67500,
          "w": 19751,
          "h": 7125
        }
      ],
      "buttons": [
        {
          "action": "goto-sheet",
          "target": null,
          "tooltip": null,
          "x": 78333,
          "y": 750,
          "w": 7584,
          "h": 8750
        },
        {
          "action": "goto-sheet",
          "target": null,
          "tooltip": null,
          "x": 85917,
          "y": 750,
          "w": 7583,
          "h": 8750
        },
        {
          "action": "toggle",
          "target": null,
          "tooltip": null,
          "x": 93500,
          "y": 750,
          "w": 7583,
          "h": 8750
        }
      ]
    },
    {
      "name": "Sales Dashboard",
      "size": {
        "w": 1200,
        "h": 800
      },
      "title": null,
      "background": "#f5f5f5",
      "zones": [
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Sales Dashboard",
          "x": 6084,
          "y": 0,
          "w": 68334,
          "h": 7375
        },
        {
          "type": "viz",
          "worksheet": "Legend KPI",
          "field": null,
          "x": 0,
          "y": 7375,
          "w": 100000,
          "h": 3625
        },
        {
          "type": "viz",
          "worksheet": "KPI Sales",
          "field": null,
          "x": 0,
          "y": 11000,
          "w": 33333,
          "h": 35500
        },
        {
          "type": "viz",
          "worksheet": "KPI Profit",
          "field": null,
          "x": 33333,
          "y": 11000,
          "w": 33334,
          "h": 35500
        },
        {
          "type": "viz",
          "worksheet": "KPI Quantity",
          "field": null,
          "x": 66667,
          "y": 11000,
          "w": 33333,
          "h": 35500
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Sales & Profit By Subcategory",
          "x": 1416,
          "y": 48625,
          "w": 47168,
          "h": 4250
        },
        {
          "type": "viz",
          "worksheet": "Legend Subcategory",
          "field": null,
          "x": 1416,
          "y": 52875,
          "w": 31167,
          "h": 4000
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
