{
  "irVersion": "1.0",
  "workbook": {
    "name": "Sales & Customer Dashboards",
    "pascalName": "SalesCustomerDashboards",
    "sourcePath": "C:/Users/BoghraJeelKishorbhai/Deterministic-Agentic/Data/Sales and Customer/Sales & Customer Dashboards.twb",
    "version": "18.1",
    "platform": ""
  },
  "dataSources": [
    {
      "name": "Sales DataSource",
      "internalName": "federated.1kpxa041aiai2y1cl4pui1t4eju9",
      "connectionClass": "textscan",
      "sourceType": "CSV",
      "files": [
        "Customers.csv",
        "C:/Users/AmanRajMAQSoftware/Downloads/Sales and Customer Dashboards/datasets/eu"
      ],
      "server": "",
      "database": null,
      "schema": null,
      "tables": [
        "Orders#csv",
        "Customers#csv",
        "Location#csv",
        "Products#csv",
        "Extract].[Orders.csv_905AF3F5FECA431C80766E0C0C188760",
        "Extract].[Customers.csv_6DC64CBD7A91476C8367C3011943FE6B",
        "Extract].[Location.csv_DF4EAC7E83794D459E9117839A9D605A",
        "Extract].[Products.csv_62ED95945D1146228C3236829E70736C"
      ],
      "relations": [
        {
          "schema": null,
          "table": "Orders#csv",
          "type": "table"
        },
        {
          "schema": null,
          "table": "Customers#csv",
          "type": "table"
        },
        {
          "schema": null,
          "table": "Location#csv",
          "type": "table"
        },
        {
          "schema": null,
          "table": "Products#csv",
          "type": "table"
        },
        {
          "schema": null,
          "table": "Extract.Orders.csv_905AF3F5FECA431C80766E0C0C188760",
          "type": "table"
        },
        {
          "schema": null,
          "table": "Extract.Customers.csv_6DC64CBD7A91476C8367C3011943FE6B",
          "type": "table"
        },
        {
          "schema": null,
          "table": "Extract.Location.csv_DF4EAC7E83794D459E9117839A9D605A",
          "type": "table"
        },
        {
          "schema": null,
          "table": "Extract.Products.csv_62ED95945D1146228C3236829E70736C",
          "type": "table"
        }
      ],
      "joins": [],
      "customSql": null,
      "connectionMode": "import",
      "active": true
    }
  ],
  "columns": [
    {
      "datasource": "Sales DataSource",
      "name": "Row ID",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 0,
      "physicalTable": "Orders.csv",
      "remoteName": "Row ID",
      "metaType": "integer"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Order ID",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 1,
      "physicalTable": "Orders.csv",
      "remoteName": "Order ID",
      "metaType": "string"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Order Date",
      "caption": null,
      "dataType": "date",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 2,
      "physicalTable": "Orders.csv",
      "remoteName": "Order Date",
      "metaType": "date"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Ship Date",
      "caption": null,
      "dataType": "date",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 3,
      "physicalTable": "Orders.csv",
      "remoteName": "Ship Date",
      "metaType": "date"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Ship Mode",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 4,
      "physicalTable": "Orders.csv",
      "remoteName": "Ship Mode",
      "metaType": "string"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Customer ID",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 5,
      "physicalTable": "Orders.csv",
      "remoteName": "Customer ID",
      "metaType": "string"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Segment",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 6,
      "physicalTable": "Orders.csv",
      "remoteName": "Segment",
      "metaType": "string"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Postal Code",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 7,
      "physicalTable": "Orders.csv",
      "remoteName": "Postal Code",
      "metaType": "integer"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Product ID",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 8,
      "physicalTable": "Orders.csv",
      "remoteName": "Product ID",
      "metaType": "string"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Sales",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 9,
      "physicalTable": "Orders.csv",
      "remoteName": "Sales",
      "metaType": "real"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Quantity",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 10,
      "physicalTable": "Orders.csv",
      "remoteName": "Quantity",
      "metaType": "integer"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Discount",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 11,
      "physicalTable": "Orders.csv",
      "remoteName": "Discount",
      "metaType": "real"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Profit",
      "caption": null,
      "dataType": "real",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 12,
      "physicalTable": "Orders.csv",
      "remoteName": "Profit",
      "metaType": "real"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Customer Name",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 14,
      "physicalTable": "Customers.csv",
      "remoteName": "Customer Name",
      "metaType": "string"
    },
    {
      "datasource": "Sales DataSource",
      "name": "City",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 16,
      "physicalTable": "Location.csv",
      "remoteName": "City",
      "metaType": "string"
    },
    {
      "datasource": "Sales DataSource",
      "name": "State",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 17,
      "physicalTable": "Location.csv",
      "remoteName": "State",
      "metaType": "string"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Region",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 18,
      "physicalTable": "Location.csv",
      "remoteName": "Region",
      "metaType": "string"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Country/Region",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 19,
      "physicalTable": "Location.csv",
      "remoteName": "Country/Region",
      "metaType": "string"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Category",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 21,
      "physicalTable": "Products.csv",
      "remoteName": "Category",
      "metaType": "string"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Sub-Category",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 22,
      "physicalTable": "Products.csv",
      "remoteName": "Sub-Category",
      "metaType": "string"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Product Name",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 23,
      "physicalTable": "Products.csv",
      "remoteName": "Product Name",
      "metaType": "string"
    },
    {
      "datasource": "Sales DataSource",
      "name": "Postal Code (Location.csv)",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": "[ZipCode].[Name]",
      "format": "*00000",
      "ordinal": 15,
      "physicalTable": "Location.csv",
      "remoteName": "Postal Code",
      "metaType": "integer"
    }
  ],
  "calculatedFields": [
    {
      "caption": "Select Year",
      "fieldName": "[Parameter 1]",
      "dataType": "integer",
      "role": "measure",
      "formula": "2023",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": []
    },
    {
      "caption": "% Diff Orders",
      "fieldName": "[% Diff Customers (copy)_3221481164597477394]",
      "dataType": "real",
      "role": "measure",
      "formula": "(COUNTD([CY Orders]) - COUNTD([PY Orders])) / COUNTD([PY Orders])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Orders",
        "PY Orders"
      ]
    },
    {
      "caption": "% Diff Customers",
      "fieldName": "[% Diff Quantity (copy)_3221481164588376075]",
      "dataType": "real",
      "role": "measure",
      "formula": "(COUNTD([CY Customers]) - COUNTD([PY Customers])) / COUNTD([PY Customers])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Customers",
        "PY Customers"
      ]
    },
    {
      "caption": "% Diff Quantity",
      "fieldName": "[% Diff Sales (copy) (copy)_237846410425131013]",
      "dataType": "real",
      "role": "measure",
      "formula": "(SUM([CY Quantity]) - SUM([PY Quantity])) / SUM([PY Quantity])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Quantity",
        "PY Quantity"
      ]
    },
    {
      "caption": "% Diff Profit",
      "fieldName": "[% Diff Sales (copy)_237846410425122820]",
      "dataType": "real",
      "role": "measure",
      "formula": "(SUM([CY Profit]) - SUM([PY Profit])) / SUM([CY Profit])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Profit",
        "PY Profit"
      ]
    },
    {
      "caption": "% Diff Sales per Customers",
      "fieldName": "[% Diff Sales (copy)_3221481164536066054]",
      "dataType": "real",
      "role": "measure",
      "formula": "([CY Sales per Customer] - [PY Sales per Customer]) / [PY Sales per Customer]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Sales per Customer",
        "PY Sales per Customer"
      ]
    },
    {
      "caption": "PY Customers",
      "fieldName": "[CY Customers (copy)_3221481164533411843]",
      "dataType": "string",
      "role": "dimension",
      "formula": "IF YEAR([Order Date])= [Select Year]-1 THEN [Customer ID] \r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Order Date",
        "Select Year",
        "Customer ID"
      ]
    },
    {
      "caption": "CY Sales per Customer",
      "fieldName": "[CY Profit (copy)_3221481164532895746]",
      "dataType": "real",
      "role": "measure",
      "formula": "SUM([CY Sales]) / COUNTD([CY Customers])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Sales",
        "CY Customers"
      ]
    },
    {
      "caption": "CY Quantity",
      "fieldName": "[CY Sales (copy) (copy)_237846410424193025]",
      "dataType": "integer",
      "role": "measure",
      "formula": "IF YEAR([Order Date]) = [Select Year] THEN [Quantity]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Order Date",
        "Select Year",
        "Quantity"
      ]
    },
    {
      "caption": "CY Profit",
      "fieldName": "[CY Sales (copy)_237846410424180736]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF YEAR([Order Date]) = [Select Year] THEN [Profit]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Order Date",
        "Select Year",
        "Profit"
      ]
    },
    {
      "caption": "CY Customers",
      "fieldName": "[CY Sales (copy)_3221481164532666369]",
      "dataType": "string",
      "role": "dimension",
      "formula": "IF YEAR([Order Date])= [Select Year] THEN [Customer ID] \r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Order Date",
        "Select Year",
        "Customer ID"
      ]
    },
    {
      "caption": "CY Orders",
      "fieldName": "[CY Sales (copy)_3221481164594982929]",
      "dataType": "string",
      "role": "dimension",
      "formula": "IF YEAR([Order Date]) = [Select Year] THEN [Order ID]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Order Date",
        "Select Year",
        "Order ID"
      ]
    },
    {
      "caption": "PY Sales",
      "fieldName": "[CY Sales (copy)_721701895335804930]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF YEAR([Order Date]) = [Select Year]-1 THEN [Sales]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Order Date",
        "Select Year",
        "Sales"
      ]
    },
    {
      "caption": "PY Sales per Customer",
      "fieldName": "[CY Sales per Customer (copy)_3221481164533485572]",
      "dataType": "real",
      "role": "measure",
      "formula": "SUM([PY Sales]) / COUNTD([PY Customers])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "PY Sales",
        "PY Customers"
      ]
    },
    {
      "caption": "Current Year",
      "fieldName": "[Calculation_1240741752607899648]",
      "dataType": "integer",
      "role": "dimension",
      "formula": "[Select Year]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Select Year"
      ]
    },
    {
      "caption": "Previous Year",
      "fieldName": "[Calculation_1240741752607936513]",
      "dataType": "integer",
      "role": "dimension",
      "formula": "[Select Year]-1",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Select Year"
      ]
    },
    {
      "caption": "KPI CY Less PY",
      "fieldName": "[Calculation_2435040078806671369]",
      "dataType": "string",
      "role": "measure",
      "formula": "IF SUM([CY Sales]) < SUM([PY Sales]) THEN '⬤'\r\nELSE ''\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Sales",
        "PY Sales"
      ]
    },
    {
      "caption": "KPI Sales Avg",
      "fieldName": "[Calculation_2435040078825054219]",
      "dataType": "string",
      "role": "measure",
      "formula": "IF SUM([CY Sales]) > WINDOW_AVG(SUM([CY Sales]))\r\nTHEN 'Above'\r\nELSE 'Below'\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Sales"
      ]
    },
    {
      "caption": "CY Sales",
      "fieldName": "[Calculation_721701895334993921]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF YEAR([Order Date]) = [Select Year] THEN [Sales]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Order Date",
        "Select Year",
        "Sales"
      ]
    },
    {
      "caption": "Order Date (Year)",
      "fieldName": "[Calculation_721701895336701956]",
      "dataType": "integer",
      "role": "measure",
      "formula": "YEAR([Order Date])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Order Date"
      ]
    },
    {
      "caption": "% Diff Sales",
      "fieldName": "[Calculation_721701895340638217]",
      "dataType": "real",
      "role": "measure",
      "formula": "(SUM([CY Sales]) - SUM([PY Sales])) / SUM([PY Sales])",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Sales",
        "PY Sales"
      ]
    },
    {
      "caption": "Min/Max Sales",
      "fieldName": "[Calculation_721701895347843083]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF SUM([CY Sales]) = WINDOW_MAX(SUM([CY Sales]))\r\nTHEN SUM([CY Sales])\r\nELSEIF SUM([CY Sales]) = WINDOW_MIN(SUM([CY Sales]))\r\nTHEN SUM([CY Sales])\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Sales"
      ]
    },
    {
      "caption": "{SUM([CY Sales])}",
      "fieldName": "[Calculation_721701895351046156]",
      "dataType": "real",
      "role": "measure",
      "formula": "{SUM([CY Sales])}",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Sales"
      ]
    },
    {
      "caption": "Nr of Orders per Customers",
      "fieldName": "[Calculation_998110323739992064]",
      "dataType": "integer",
      "role": "dimension",
      "formula": "{ FIXED [CY Customers]: COUNTD([CY Orders])}",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "CY Customers",
        "CY Orders"
      ]
    },
    {
      "caption": "KPI Profit Avg",
      "fieldName": "[KPI Sales Avg (copy)_2435040078826737676]",
      "dataType": "string",
      "role": "measure",
      "formula": "IF SUM([CY Profit]) > WINDOW_AVG(SUM([CY Profit]))\r\nTHEN 'Above'\r\nELSE 'Below'\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Profit"
      ]
    },
    {
      "caption": "Min/Max Sales Per Customers",
      "fieldName": "[Min/Max Quantity (copy)_3221481164537155591]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF [CY Sales per Customer] = WINDOW_MAX([CY Sales per Customer])\r\nTHEN [CY Sales per Customer] \r\nELSEIF [CY Sales per Customer] = WINDOW_MIN([CY Sales per Customer])\r\nTHEN [CY Sales per Customer]\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Sales per Customer"
      ]
    },
    {
      "caption": "Min/Max Customers",
      "fieldName": "[Min/Max Quantity (copy)_3221481164588691468]",
      "dataType": "integer",
      "role": "measure",
      "formula": "IF COUNTD([CY Customers]) = WINDOW_MAX(COUNTD([CY Customers]))\r\nTHEN COUNTD([CY Customers])\r\nELSEIF COUNTD([CY Customers]) = WINDOW_MIN(COUNTD([CY Customers]))\r\nTHEN COUNTD([CY Customers])\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Customers"
      ]
    },
    {
      "caption": "Min/Max Quantity",
      "fieldName": "[Min/Max Sales (copy) (copy)_237846410425856007]",
      "dataType": "integer",
      "role": "measure",
      "formula": "IF SUM([CY Quantity]) = WINDOW_MAX(SUM([CY Quantity]))\r\nTHEN SUM([CY Quantity])\r\nELSEIF SUM([CY Quantity]) = WINDOW_MIN(SUM([CY Quantity]))\r\nTHEN SUM([CY Quantity])\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Quantity"
      ]
    },
    {
      "caption": "Min/Max Profit",
      "fieldName": "[Min/Max Sales (copy)_237846410425847814]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF SUM([CY Profit]) = WINDOW_MAX(SUM([CY Profit]))\r\nTHEN SUM([CY Profit])\r\nELSEIF SUM([CY Profit]) = WINDOW_MIN(SUM([CY Profit]))\r\nTHEN SUM([CY Profit])\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Profit"
      ]
    },
    {
      "caption": "Min/Max Orders",
      "fieldName": "[Min/Max Sales (copy)_3221481164601258003]",
      "dataType": "integer",
      "role": "measure",
      "formula": "IF COUNTD([CY Orders]) = WINDOW_MAX(COUNTD([CY Orders]))\r\nTHEN COUNTD([CY Orders])\r\nELSEIF COUNTD([CY Orders]) = WINDOW_MIN(COUNTD([CY Orders]))\r\nTHEN COUNTD([CY Orders])\r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "CY Orders"
      ]
    },
    {
      "caption": "PY Quantity",
      "fieldName": "[PY Sales (copy) (copy)_237846410424823811]",
      "dataType": "integer",
      "role": "measure",
      "formula": "IF YEAR([Order Date]) = [Select Year]-1 THEN [Quantity]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Order Date",
        "Select Year",
        "Quantity"
      ]
    },
    {
      "caption": "PY Profit",
      "fieldName": "[PY Sales (copy)_237846410424815618]",
      "dataType": "real",
      "role": "measure",
      "formula": "IF YEAR([Order Date]) = [Select Year]-1 THEN [Profit]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure",
      "dependsOn": [
        "Order Date",
        "Select Year",
        "Profit"
      ]
    },
    {
      "caption": "PY Orders",
      "fieldName": "[PY Sales (copy)_3221481164594888720]",
      "dataType": "string",
      "role": "dimension",
      "formula": "IF YEAR([Order Date]) = [Select Year]-1 THEN [Order ID]\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column",
      "dependsOn": [
        "Order Date",
        "Select Year",
        "Order ID"
      ]
    }
  ],
  "parameters": [
    {
      "name": "Select Year",
      "internalName": "[Parameter 1]",
      "dataType": "integer",
      "domainType": "list",
      "default": "2023",
      "values": [
        "2020",
        "2021",
        "2022",
        "2023"
      ],
      "range": null,
      "format": "n0;-0"
    }
  ],
  "worksheets": [
    {
      "name": "Customer Distribution",
      "datasource": "Sales DataSource",
      "markClass": "Bar",
      "rows": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[ctd:CY Sales (copy)_3221481164532666369:qk"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[none:Calculation_998110323739992064:ok"
      ],
      "encodings": {
        "color": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[ctd:CY Sales (copy)_3221481164532666369:qk",
        "size": null,
        "text": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[ctd:CY Sales (copy)_3221481164532666369:qk",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Nr of Orders per Customers",
      "valueField": "CY Customers",
      "categoryDateLevel": null,
      "dimensions": [
        "Nr of Orders per Customers",
        "Category",
        "City",
        "Region",
        "State",
        "Sub-Category"
      ],
      "values": [
        "CY Customers"
      ],
      "measures": [
        {
          "field": "CY Customers",
          "agg": "COUNTD",
          "column": "CY Sales (copy)_3221481164532666369"
        }
      ],
      "axes": {
        "category": "Nr of Orders per Customers",
        "categoryLevel": null,
        "values": [
          "CY Customers"
        ],
        "orientation": "vertical"
      },
      "orientation": "vertical",
      "caption": null,
      "title": null,
      "filters": [
        "Category",
        "City",
        "Region",
        "State",
        "Sub-Category"
      ],
      "filterDetails": [
        {
          "field": "Category",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "City",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Region",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "State",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Sub-Category",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#f1f1f1",
          "#d9e8ed",
          "#c2e0ea",
          "#abd7e7",
          "#95cfe3",
          "#7fc7e0",
          "#6abfdd",
          "#56b8d9",
          "#42b0d6",
          "#2fa9d3",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": false,
        "markStroke": "#333333",
        "showMarkLabels": true,
        "markColor": null,
        "background": null,
        "fontName": null,
        "fontSize": "10",
        "fontColor": "#000000",
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "barChart"
    },
    {
      "name": "KPI Customers",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Min",
        "Max Quantity (copy)_3221481164588691468:qk])"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[mn:Order Date:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:Calculation_3221481164589563917:qk",
        "label": null,
        "tooltip": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[attr:Calculation_1240741752607899648:qk",
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Order Date",
      "valueField": "Current Year",
      "categoryDateLevel": "month",
      "dimensions": [
        "Order Date",
        "Category",
        "City",
        "Region",
        "State",
        "Sub-Category"
      ],
      "values": [
        "Current Year",
        "Previous Year",
        "PY Customers",
        "CY Customers",
        "Calculation",
        "% Diff Customers",
        "Min/Max Customers"
      ],
      "measures": [
        {
          "field": "Current Year",
          "agg": "SUM",
          "column": "Calculation_1240741752607899648"
        },
        {
          "field": "Previous Year",
          "agg": "SUM",
          "column": "Calculation_1240741752607936513"
        },
        {
          "field": "PY Customers",
          "agg": "COUNTD",
          "column": "CY Customers (copy)_3221481164533411843"
        },
        {
          "field": "CY Customers",
          "agg": "COUNTD",
          "column": "CY Sales (copy)_3221481164532666369"
        },
        {
          "field": "Calculation",
          "agg": "SUM",
          "column": "Calculation_3221481164589563917"
        },
        {
          "field": "% Diff Customers",
          "agg": "SUM",
          "column": "% Diff Quantity (copy)_3221481164588376075"
        },
        {
          "field": "Min/Max Customers",
          "agg": "SUM",
          "column": "Min/Max Quantity (copy)_3221481164588691468"
        }
      ],
      "axes": {
        "category": "Order Date",
        "categoryLevel": "month",
        "values": [
          "Current Year",
          "Previous Year",
          "PY Customers",
          "CY Customers",
          "Calculation",
          "% Diff Customers",
          "Min/Max Customers"
        ],
        "orientation": "vertical"
      },
      "orientation": "vertical",
      "caption": null,
      "title": "Total Customers\n{value}\n{value}  vs. PY",
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "filterDetails": [
        {
          "field": "Category",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Sub-Category",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Region",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "State",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "City",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#ff5500",
          "#f86e29",
          "#f28650",
          "#ec9d76",
          "#e5b299",
          "#dfc6ba",
          "#d9d9d9",
          "#b8cfd7",
          "#98c6d6",
          "#79bdd4",
          "#59b3d3",
          "#3baad1",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": false,
        "markColor": null,
        "background": null,
        "fontName": null,
        "fontSize": null,
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "KPI Orders",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Min",
        "Max Sales (copy)_3221481164601258003:qk])"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[mn:Order Date:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:Calculation_3221481164605767702:qk",
        "label": null,
        "tooltip": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[attr:Calculation_1240741752607899648:qk",
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Order Date",
      "valueField": "Current Year",
      "categoryDateLevel": "month",
      "dimensions": [
        "Order Date",
        "Category",
        "City",
        "Region",
        "State",
        "Sub-Category"
      ],
      "values": [
        "Current Year",
        "Previous Year",
        "CY Orders",
        "PY Orders",
        "Calculation",
        "% Diff Orders",
        "Min/Max Customers",
        "Min/Max Orders"
      ],
      "measures": [
        {
          "field": "Current Year",
          "agg": "SUM",
          "column": "Calculation_1240741752607899648"
        },
        {
          "field": "Previous Year",
          "agg": "SUM",
          "column": "Calculation_1240741752607936513"
        },
        {
          "field": "CY Orders",
          "agg": "COUNTD",
          "column": "CY Sales (copy)_3221481164594982929"
        },
        {
          "field": "PY Orders",
          "agg": "COUNTD",
          "column": "PY Sales (copy)_3221481164594888720"
        },
        {
          "field": "Calculation",
          "agg": "SUM",
          "column": "Calculation_3221481164605767702"
        },
        {
          "field": "% Diff Orders",
          "agg": "SUM",
          "column": "% Diff Customers (copy)_3221481164597477394"
        },
        {
          "field": "Min/Max Customers",
          "agg": "SUM",
          "column": "Min/Max Quantity (copy)_3221481164588691468"
        },
        {
          "field": "Min/Max Orders",
          "agg": "SUM",
          "column": "Min/Max Sales (copy)_3221481164601258003"
        }
      ],
      "axes": {
        "category": "Order Date",
        "categoryLevel": "month",
        "values": [
          "Current Year",
          "Previous Year",
          "CY Orders",
          "PY Orders",
          "Calculation",
          "% Diff Orders",
          "Min/Max Customers",
          "Min/Max Orders"
        ],
        "orientation": "vertical"
      },
      "orientation": "vertical",
      "caption": null,
      "title": "Total Orders\n{value}\n{value}  vs. PY",
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "filterDetails": [
        {
          "field": "Category",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Sub-Category",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Region",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "State",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "City",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#ff5500",
          "#f86e29",
          "#f28650",
          "#ec9d76",
          "#e5b299",
          "#dfc6ba",
          "#d9d9d9",
          "#b8cfd7",
          "#98c6d6",
          "#79bdd4",
          "#59b3d3",
          "#3baad1",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": false,
        "markColor": null,
        "background": null,
        "fontName": null,
        "fontSize": null,
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "KPI Profit",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Min",
        "Max Sales (copy)_237846410425847814:qk])"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[mn:Order Date:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[attr:Calculation_1240741752607899648:qk",
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Order Date",
      "valueField": "Current Year",
      "categoryDateLevel": "month",
      "dimensions": [
        "Order Date",
        "Category",
        "City",
        "Region",
        "State",
        "Sub-Category"
      ],
      "values": [
        "Current Year",
        "Previous Year",
        "CY Profit",
        "Calculation",
        "PY Profit",
        "% Diff Profit",
        "Min/Max Profit"
      ],
      "measures": [
        {
          "field": "Current Year",
          "agg": "SUM",
          "column": "Calculation_1240741752607899648"
        },
        {
          "field": "Previous Year",
          "agg": "SUM",
          "column": "Calculation_1240741752607936513"
        },
        {
          "field": "CY Profit",
          "agg": "SUM",
          "column": "CY Sales (copy)_237846410424180736"
        },
        {
          "field": "Calculation",
          "agg": "SUM",
          "column": "Calculation_237846410426408968"
        },
        {
          "field": "PY Profit",
          "agg": "SUM",
          "column": "PY Sales (copy)_237846410424815618"
        },
        {
          "field": "% Diff Profit",
          "agg": "SUM",
          "column": "% Diff Sales (copy)_237846410425122820"
        },
        {
          "field": "Min/Max Profit",
          "agg": "SUM",
          "column": "Min/Max Sales (copy)_237846410425847814"
        }
      ],
      "axes": {
        "category": "Order Date",
        "categoryLevel": "month",
        "values": [
          "Current Year",
          "Previous Year",
          "CY Profit",
          "Calculation",
          "PY Profit",
          "% Diff Profit",
          "Min/Max Profit"
        ],
        "orientation": "vertical"
      },
      "orientation": "vertical",
      "caption": null,
      "title": "Total Profit\n{value}\n{value}  vs. PY",
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "filterDetails": [
        {
          "field": "Category",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Sub-Category",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Region",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "State",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "City",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#ff5500",
          "#f86e29",
          "#f28650",
          "#ec9d76",
          "#e5b299",
          "#dfc6ba",
          "#d9d9d9",
          "#b8cfd7",
          "#98c6d6",
          "#79bdd4",
          "#59b3d3",
          "#3baad1",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": false,
        "markColor": null,
        "background": null,
        "fontName": null,
        "fontSize": null,
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "KPI Quantity",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Min",
        "Max Sales (copy) (copy)_237846410425856007:qk])"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[mn:Order Date:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:Calculation_237846410429689866:qk",
        "label": null,
        "tooltip": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[attr:Calculation_1240741752607899648:qk",
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Order Date",
      "valueField": "Current Year",
      "categoryDateLevel": "month",
      "dimensions": [
        "Order Date",
        "Category",
        "City",
        "Region",
        "State",
        "Sub-Category"
      ],
      "values": [
        "Current Year",
        "Previous Year",
        "CY Quantity",
        "Calculation",
        "PY Quantity",
        "% Diff Quantity",
        "Min/Max Quantity"
      ],
      "measures": [
        {
          "field": "Current Year",
          "agg": "SUM",
          "column": "Calculation_1240741752607899648"
        },
        {
          "field": "Previous Year",
          "agg": "SUM",
          "column": "Calculation_1240741752607936513"
        },
        {
          "field": "CY Quantity",
          "agg": "SUM",
          "column": "CY Sales (copy) (copy)_237846410424193025"
        },
        {
          "field": "Calculation",
          "agg": "SUM",
          "column": "Calculation_237846410429689866"
        },
        {
          "field": "PY Quantity",
          "agg": "SUM",
          "column": "PY Sales (copy) (copy)_237846410424823811"
        },
        {
          "field": "% Diff Quantity",
          "agg": "SUM",
          "column": "% Diff Sales (copy) (copy)_237846410425131013"
        },
        {
          "field": "Min/Max Quantity",
          "agg": "SUM",
          "column": "Min/Max Sales (copy) (copy)_237846410425856007"
        }
      ],
      "axes": {
        "category": "Order Date",
        "categoryLevel": "month",
        "values": [
          "Current Year",
          "Previous Year",
          "CY Quantity",
          "Calculation",
          "PY Quantity",
          "% Diff Quantity",
          "Min/Max Quantity"
        ],
        "orientation": "vertical"
      },
      "orientation": "vertical",
      "caption": null,
      "title": "Total Quantity\n{value}\n{value}  vs. PY",
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "filterDetails": [
        {
          "field": "Category",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Sub-Category",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Region",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "State",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "City",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#ff5500",
          "#f86e29",
          "#f28650",
          "#ec9d76",
          "#e5b299",
          "#dfc6ba",
          "#d9d9d9",
          "#b8cfd7",
          "#98c6d6",
          "#79bdd4",
          "#59b3d3",
          "#3baad1",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": false,
        "markColor": null,
        "background": null,
        "fontName": null,
        "fontSize": null,
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "KPI Sales",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Calculation_721701895347843083:qk])"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[mn:Order Date:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:Calculation_721701895351046156:qk",
        "label": null,
        "tooltip": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[attr:Calculation_1240741752607899648:qk",
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Order Date",
      "valueField": "Current Year",
      "categoryDateLevel": "month",
      "dimensions": [
        "Order Date",
        "Category",
        "City",
        "Region",
        "State",
        "Sub-Category"
      ],
      "values": [
        "Current Year",
        "Previous Year",
        "PY Sales",
        "CY Sales",
        "{SUM([CY Sales])}",
        "Calculation",
        "% Diff Sales",
        "Min/Max Sales"
      ],
      "measures": [
        {
          "field": "Current Year",
          "agg": "SUM",
          "column": "Calculation_1240741752607899648"
        },
        {
          "field": "Previous Year",
          "agg": "SUM",
          "column": "Calculation_1240741752607936513"
        },
        {
          "field": "PY Sales",
          "agg": "SUM",
          "column": "CY Sales (copy)_721701895335804930"
        },
        {
          "field": "CY Sales",
          "agg": "SUM",
          "column": "Calculation_721701895334993921"
        },
        {
          "field": "{SUM([CY Sales])}",
          "agg": "SUM",
          "column": "Calculation_721701895351046156"
        },
        {
          "field": "Calculation",
          "agg": "SUM",
          "column": "Calculation_721701895351123981"
        },
        {
          "field": "% Diff Sales",
          "agg": "SUM",
          "column": "Calculation_721701895340638217"
        },
        {
          "field": "Min/Max Sales",
          "agg": "SUM",
          "column": "Calculation_721701895347843083"
        }
      ],
      "axes": {
        "category": "Order Date",
        "categoryLevel": "month",
        "values": [
          "Current Year",
          "Previous Year",
          "PY Sales",
          "CY Sales",
          "{SUM([CY Sales])}",
          "Calculation",
          "% Diff Sales",
          "Min/Max Sales"
        ],
        "orientation": "vertical"
      },
      "orientation": "vertical",
      "caption": null,
      "title": "Total Sales\n{{SUM([CY Sales])}}\n{value}  vs. PY",
      "filters": [
        "Category",
        "Sub-Category",
        "Region",
        "State",
        "City"
      ],
      "filterDetails": [
        {
          "field": "Category",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Sub-Category",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "Region",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "State",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        },
        {
          "field": "City",
          "filterClass": null,
          "scope": null,
          "values": null,
          "range": null
        }
      ],
      "topN": null,
      "sort": null,
      "formatting": {
        "colorPalette": [
          "#ff5500",
          "#f86e29",
          "#f28650",
          "#ec9d76",
          "#e5b299",
          "#dfc6ba",
          "#d9d9d9",
          "#b8cfd7",
          "#98c6d6",
          "#79bdd4",
          "#59b3d3",
          "#3baad1",
          "#1da2d0"
        ],
        "gridlines": false,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": false,
        "markColor": null,
        "background": null,
        "fontName": null,
        "fontSize": null,
        "fontColor": null,
        "alignment": null,
        "titleColor": null,
        "titleFontSize": null
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "KPI Sales Per Customers",
      "datasource": "Sales DataSource",
      "markClass": "Automatic",
      "rows": [
        "([federated.1kpxa041aiai2y1cl4pui1t4eju9].[Multiple Values] + [federated.1kpxa041aiai2y1cl4pui1t4eju9].[usr:Min",
        "Max Quantity (copy)_3221481164537155591:qk])"
      ],
      "cols": [
        "federated.1kpxa041aiai2y1cl4pui1t4eju9].[mn:Order Date:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": "federated.1kpxa041aiai2y1cl4pui1t4eju9].[sum:Calculation_3221481164565110792:qk",
        "label": null,
