{
  "irVersion": "1.0",
  "workbook": {
    "name": "Midnight Census Dashboard",
    "pascalName": "MidnightCensusDashboard",
    "sourcePath": "Data/Midnight Census/Midnight Census Dashboard.twb",
    "version": "18.1",
    "platform": ""
  },
  "dataSources": [
    {
      "name": "Midnight Census NEW",
      "internalName": "federated.0l4ojaz172oi9916uui6o0yakgnb",
      "connectionClass": "hyper",
      "sourceType": "Hyper",
      "files": [],
      "server": "",
      "database": "C:/Users/AmanRajMAQSoftware/Downloads/Midnight_Census_Template.hyper",
      "schema": "Extract",
      "tables": [
        "Custom SQL Query",
        "Extract].[Extract"
      ],
      "active": false
    },
    {
      "name": "Midnight_Census_Template",
      "internalName": "federated.09go31s1b3pn2k1ezewf3027s71v",
      "connectionClass": "textscan",
      "sourceType": "CSV",
      "files": [
        "Midnight_Census_Template.csv",
        "C:/Users/AmanRajMAQSoftware/Downloads/Midnight Census"
      ],
      "server": "",
      "database": null,
      "schema": null,
      "tables": [
        "Midnight_Census_Template#csv"
      ],
      "active": true
    }
  ],
  "columns": [
    {
      "datasource": "Midnight Census NEW",
      "name": "Census Date",
      "caption": null,
      "dataType": "date",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 6
    },
    {
      "datasource": "Midnight_Census_Template",
      "name": "DEPARTMENT_KEY",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 0
    },
    {
      "datasource": "Midnight_Census_Template",
      "name": "Encounter CSN",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 1
    },
    {
      "datasource": "Midnight_Census_Template",
      "name": "Parent Hospital",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 2
    },
    {
      "datasource": "Midnight_Census_Template",
      "name": "Hospital",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 3
    },
    {
      "datasource": "Midnight_Census_Template",
      "name": "Unit",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 4
    },
    {
      "datasource": "Midnight_Census_Template",
      "name": "Patient Class",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 5
    },
    {
      "datasource": "Midnight_Census_Template",
      "name": "Census Date",
      "caption": null,
      "dataType": "date",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 6
    },
    {
      "datasource": "Midnight_Census_Template",
      "name": "Census Count",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 7
    },
    {
      "datasource": "Midnight_Census_Template",
      "name": "Census Count Adults",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 8
    },
    {
      "datasource": "Midnight_Census_Template",
      "name": "Census Count Peds",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 9
    }
  ],
  "calculatedFields": [
    {
      "caption": "Filter Adults/Peds",
      "fieldName": "[End Date (copy)]",
      "dataType": "string",
      "role": "measure",
      "formula": "\"(All)\"",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Date Agg Level",
      "fieldName": "[Parameter 1]",
      "dataType": "string",
      "role": "measure",
      "formula": "\"Monthly\"",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "View",
      "fieldName": "[Parameter 2]",
      "dataType": "string",
      "role": "measure",
      "formula": "\"Bar Chart\"",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Start Date",
      "fieldName": "[Parameter 3]",
      "dataType": "date",
      "role": "measure",
      "formula": "#2026-01-01#",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "End Date",
      "fieldName": "[Start Date (copy)_305681891901829120]",
      "dataType": "date",
      "role": "measure",
      "formula": "#2026-06-09#",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "User Defined Census Count",
      "fieldName": "[Calculation_2234066952297496576]",
      "dataType": "integer",
      "role": "measure",
      "formula": "CASE [Parameters].[End Date (copy)]\r\n    WHEN '(All)' THEN SUM([Census Count])\r\n    WHEN 'Adults' THEN SUM([Census Count Adults])\r\n    WHEN 'Peds' THEN SUM([Census Count Peds])\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Date Range Filter",
      "fieldName": "[Calculation_2234066952299909123]",
      "dataType": "boolean",
      "role": "dimension",
      "formula": "[Census Date] >= [Parameters].[Parameter 3] AND [Census Date] <= [Parameters].[Start Date (copy)_305681891901829120]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Start Month Contains Partial Data?",
      "fieldName": "[Calculation_2234066952300421124]",
      "dataType": "integer",
      "role": "measure",
      "formula": "IF\r\nYEAR(MAX([Census Date])) = YEAR(MAX([Parameters].[Parameter 3]))\r\nAND MONTH(MAX([Census Date])) = MONTH(MAX([Parameters].[Parameter 3]))\r\nAND MIN([Parameters].[Parameter 3]) <> DATE(STR(YEAR(WINDOW_MIN(MIN([Census Date]))))+'-'+STR(MONTH(WINDOW_MIN(MIN([Census Date]))))+'-01')\r\nTHEN 1 ELSE 0 END",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "End Month Contains Partial Data?",
      "fieldName": "[Calculation_2234066952300756997]",
      "dataType": "integer",
      "role": "measure",
      "formula": "IF MONTH(MAX([Parameters].[Start Date (copy)_305681891901829120])) = 12 THEN\r\n    IF YEAR(MAX([Census Date])) = YEAR(MAX([Parameters].[Start Date (copy)_305681891901829120]))\r\n    AND MONTH(MAX([Census Date])) = MONTH(MAX([Parameters].[Start Date (copy)_305681891901829120]))\r\n    AND MAX([Parameters].[Start Date (copy)_305681891901829120]) <> DATEADD('day', -1, DATE(STR(YEAR(WINDOW_MAX(MAX([Census Date])))+1)+'-'+STR(MONTH(DATEADD('month', 1, WINDOW_MAX(MAX([Census Date])))))+'-01'))\r\n    THEN 1 ELSE 0 END\r\nELSEIF YEAR(MAX([Census Date])) = YEAR(MAX([Parameters].[Start Date (copy)_305681891901829120]))\r\n    AND MONTH(MAX([Census Date])) = MONTH(MAX([Parameters].[Start Date (copy)_305681891901829120]))\r\n    AND MAX([Parameters].[Start Date (copy)_305681891901829120]) <> DATEADD('day', -1, DATE(STR(YEAR(WINDOW_MAX(MAX([Census Date]))))+'-'+STR(MONTH(DATEADD('month', 1, WINDOW_MAX(MAX([Census Date])))))+'-01'))\r\n    THEN 1 ELSE 0 \r\nEND",
      "isTableCalc": true,
      "complexity": "complex",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "Default Start Date",
      "fieldName": "[Calculation_2234066952304320524]",
      "dataType": "date",
      "role": "dimension",
      "formula": "IF MONTH(TODAY()) >= 7 OR MONTH(TODAY()) <= 9 \r\nTHEN DATE(STR(YEAR(TODAY())) + '-01-01')\r\nELSE\r\n    IF MONTH(TODAY()) < 7 THEN\r\n        DATE(STR(YEAR(TODAY())-1) + '-07-01')\r\n    ELSE DATE(STR(YEAR(TODAY())) + '-07-01')\r\n    END\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Default End Date",
      "fieldName": "[Calculation_2234066952304459789]",
      "dataType": "date",
      "role": "dimension",
      "formula": "TODAY()-1",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Date agg_Monthly",
      "fieldName": "[Calculation_2234066952309055503]",
      "dataType": "string",
      "role": "dimension",
      "formula": "CASE [Parameters].[Parameter 1]\r\n    WHEN 'Monthly' THEN 'Include'\r\n    ELSE 'Exclude'\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Partial Months in View?",
      "fieldName": "[Calculation_2234066952314589212]",
      "dataType": "string",
      "role": "dimension",
      "formula": "IF DAY([Parameters].[Parameter 3]) != 1\r\n    OR DAY(DATEADD('day',1,[Parameters].[Start Date (copy)_305681891901829120])) != 1\r\nTHEN \"**Partial months are displayed in GRAY**\" ELSE \"\" END",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "View_BarChart",
      "fieldName": "[Calculation_2234066952316727326]",
      "dataType": "string",
      "role": "dimension",
      "formula": "CASE [Parameters].[Parameter 2]\r\n    WHEN 'Bar Chart' THEN 'Include'\r\n    ELSE 'Exclude' \r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Census Date_CY",
      "fieldName": "[Census Date (copy)_2234066952299266050]",
      "dataType": "date",
      "role": "dimension",
      "formula": "[Census Date]",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "Date agg_Daily",
      "fieldName": "[Date agg_Monthly (copy)_2234066952309211152]",
      "dataType": "string",
      "role": "dimension",
      "formula": "CASE [Parameters].[Parameter 1]\r\n    WHEN 'Daily' THEN 'Include'\r\n    ELSE 'Exclude'\r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    },
    {
      "caption": "View_DataTable",
      "fieldName": "[View_BarChart (copy)_2234066952316837919]",
      "dataType": "string",
      "role": "dimension",
      "formula": "CASE [Parameters].[Parameter 2]\r\n    WHEN 'Data Table' THEN 'Include'\r\n    ELSE 'Exclude' \r\nEND",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "column"
    }
  ],
  "parameters": [
    {
      "name": "Filter Adults/Peds",
      "internalName": "[End Date (copy)]",
      "dataType": "string",
      "domainType": "list",
      "default": "\"(All)\"",
      "values": [
        "\"(All)\"",
        "\"Adults\"",
        "\"Peds\""
      ],
      "range": null,
      "format": null
    },
    {
      "name": "Date Agg Level",
      "internalName": "[Parameter 1]",
      "dataType": "string",
      "domainType": "list",
      "default": "\"Monthly\"",
      "values": [
        "\"Monthly\"",
        "\"Daily\""
      ],
      "range": null,
      "format": null
    },
    {
      "name": "View",
      "internalName": "[Parameter 2]",
      "dataType": "string",
      "domainType": "list",
      "default": "\"Bar Chart\"",
      "values": [
        "\"Bar Chart\"",
        "\"Data Table\""
      ],
      "range": null,
      "format": null
    },
    {
      "name": "Start Date",
      "internalName": "[Parameter 3]",
      "dataType": "date",
      "domainType": "range",
      "default": "#2026-01-01#",
      "values": [],
      "range": {
        "min": "#2021-01-01#",
        "max": null,
        "granularity": null
      },
      "format": "*m/d/yyyy"
    },
    {
      "name": "End Date",
      "internalName": "[Start Date (copy)_305681891901829120]",
      "dataType": "date",
      "domainType": "range",
      "default": "#2026-06-09#",
      "values": [],
      "range": null,
      "format": "*m/d/yyyy"
    }
  ],
  "worksheets": [
    {
      "name": "Daily bar",
      "datasource": "Midnight_Census_Template",
      "markClass": "Bar",
      "rows": [
        "federated.09go31s1b3pn2k1ezewf3027s71v].[usr:Calculation_2234066952297496576:qk"
      ],
      "cols": [
        "([federated.09go31s1b3pn2k1ezewf3027s71v].[yr:Census Date:ok]",
        "([federated.09go31s1b3pn2k1ezewf3027s71v].[mn:Census Date:ok]",
        "[federated.09go31s1b3pn2k1ezewf3027s71v].[none:Census Date:ok]))"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Census Date",
      "valueField": "User Defined Census Count",
      "categoryDateLevel": "day",
      "dimensions": [
        "Census Date"
      ],
      "values": [
        "User Defined Census Count"
      ],
      "caption": null,
      "title": null,
      "filters": [
        "Date Range Filter",
        "Hospital",
        "Parent Hospital",
        "Patient Class",
        "Unit",
        "Date agg_Daily",
        "View_BarChart"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": "barChart"
    },
    {
      "name": "Daily table",
      "datasource": "Midnight_Census_Template",
      "markClass": "Text",
      "rows": [
        "([federated.09go31s1b3pn2k1ezewf3027s71v].[none:Hospital:nk]",
        "[federated.09go31s1b3pn2k1ezewf3027s71v].[none:Unit:nk])"
      ],
      "cols": [
        "([federated.09go31s1b3pn2k1ezewf3027s71v].[yr:Census Date:ok]",
        "[federated.09go31s1b3pn2k1ezewf3027s71v].[none:Census Date:ok])"
      ],
      "encodings": {
        "color": "federated.09go31s1b3pn2k1ezewf3027s71v].[usr:Calculation_2234066952300421124:ok",
        "size": null,
        "text": "federated.09go31s1b3pn2k1ezewf3027s71v].[usr:Calculation_2234066952297496576:qk",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Census Date",
      "valueField": "Start Month Contains Partial Data?",
      "categoryDateLevel": "day",
      "dimensions": [
        "Census Date",
        "Hospital",
        "Unit"
      ],
      "values": [
        "Start Month Contains Partial Data?",
        "User Defined Census Count"
      ],
      "caption": null,
      "title": null,
      "filters": [
        "Date Range Filter",
        "Hospital",
        "Parent Hospital",
        "Patient Class",
        "Unit",
        "Date agg_Daily",
        "View_DataTable"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "Filters",
      "datasource": "Midnight_Census_Template",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": null,
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [],
      "caption": null,
      "title": null,
      "filters": [
        "Date Range Filter",
        "Hospital",
        "Parent Hospital",
        "Patient Class",
        "Unit"
      ],
      "sort": null,
      "formatting": null,
      "inferredVisualType": "card"
    },
    {
      "name": "Filters Applied Caption",
      "datasource": "Midnight_Census_Template",
      "markClass": "Bar",
      "rows": [],
      "cols": [
        "([federated.09go31s1b3pn2k1ezewf3027s71v].[yr:Census Date:ok]",
        "[federated.09go31s1b3pn2k1ezewf3027s71v].[mn:Census Date:ok])"
      ],
      "encodings": {
        "color": "federated.09go31s1b3pn2k1ezewf3027s71v].[usr:Calculation_2234066952300421124:ok",
        "size": null,
        "text": null,
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Census Date",
      "valueField": "Start Month Contains Partial Data?",
      "categoryDateLevel": "month",
      "dimensions": [
        "Census Date"
      ],
      "values": [
        "Start Month Contains Partial Data?"
      ],
      "caption": "Filter(s) Applied: Date Range: {Start Date}-{End Date}; Parent Hospital(s): {Parent Hospital}; Hospital(s): {Hospital}; Unit(s): {Unit}; Patient Class: {Patient Class}; Filter Adults/Peds: {Filter Adults/Peds}",
      "title": null,
      "filters": [
        "Date Range Filter",
        "Hospital",
        "Parent Hospital",
        "Patient Class",
        "Unit",
        "View_BarChart"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": "barChart"
    },
    {
      "name": "Last Refresh Date",
      "datasource": "Midnight_Census_Template",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": null,
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [],
      "caption": null,
      "title": "{Sheet Name}\n{Data Update Time}\nRefreshes Daily (2:00 AM)",
      "filters": [
        "Date Range Filter",
        "Hospital",
        "Parent Hospital",
        "Patient Class",
        "Unit"
      ],
      "sort": null,
      "formatting": null,
      "inferredVisualType": "card"
    },
    {
      "name": "Monthly bar",
      "datasource": "Midnight_Census_Template",
      "markClass": "Bar",
      "rows": [
        "federated.09go31s1b3pn2k1ezewf3027s71v].[usr:Calculation_2234066952297496576:qk"
      ],
      "cols": [
        "([federated.09go31s1b3pn2k1ezewf3027s71v].[yr:Census Date:ok]",
        "[federated.09go31s1b3pn2k1ezewf3027s71v].[mn:Census Date:ok])"
      ],
      "encodings": {
        "color": "federated.09go31s1b3pn2k1ezewf3027s71v].[usr:Calculation_2234066952300421124:ok",
        "size": null,
        "text": null,
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Census Date",
      "valueField": "User Defined Census Count",
      "categoryDateLevel": "month",
      "dimensions": [
        "Census Date"
      ],
      "values": [
        "User Defined Census Count",
        "Start Month Contains Partial Data?"
      ],
      "caption": null,
      "title": null,
      "filters": [
        "Date Range Filter",
        "Hospital",
        "Parent Hospital",
        "Patient Class",
        "Unit",
        "Date agg_Monthly",
        "View_BarChart"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": "barChart"
    },
    {
      "name": "Monthly table",
      "datasource": "Midnight_Census_Template",
      "markClass": "Text",
      "rows": [
        "([federated.09go31s1b3pn2k1ezewf3027s71v].[none:Hospital:nk]",
        "[federated.09go31s1b3pn2k1ezewf3027s71v].[none:Unit:nk])"
      ],
      "cols": [
        "([federated.09go31s1b3pn2k1ezewf3027s71v].[yr:Census Date:ok]",
        "([federated.09go31s1b3pn2k1ezewf3027s71v].[mn:Census Date:ok]",
        "[federated.09go31s1b3pn2k1ezewf3027s71v].[yr:Census Date (copy)_2234066952299266050:ok]))"
      ],
      "encodings": {
        "color": "federated.09go31s1b3pn2k1ezewf3027s71v].[usr:Calculation_2234066952300421124:ok",
        "size": null,
        "text": "federated.09go31s1b3pn2k1ezewf3027s71v].[usr:Calculation_2234066952297496576:qk",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": "Census Date",
      "valueField": "Start Month Contains Partial Data?",
      "categoryDateLevel": "month",
      "dimensions": [
        "Census Date",
        "Census Date_CY",
        "Hospital",
        "Unit"
      ],
      "values": [
        "Start Month Contains Partial Data?",
        "User Defined Census Count"
      ],
      "caption": null,
      "title": null,
      "filters": [
        "Date Range Filter",
        "Hospital",
        "Parent Hospital",
        "Patient Class",
        "Unit",
        "Date agg_Monthly",
        "View_DataTable"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": false,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": "tableEx"
    },
    {
      "name": "Partial Data Warning",
      "datasource": "Midnight_Census_Template",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.09go31s1b3pn2k1ezewf3027s71v].[none:Calculation_2234066952314589212:nk",
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": null,
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [],
      "caption": null,
      "title": null,
      "filters": [
        "Date Range Filter",
        "Hospital",
        "Parent Hospital",
        "Patient Class",
        "Unit"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": "card"
    },
    {
      "name": "Sheet 9",
      "datasource": "Midnight_Census_Template",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": null,
        "shape": null,
        "detail": null,
        "label": null,
        "tooltip": null,
        "wedgeSize": null,
        "path": null
      },
      "categoryField": null,
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [],
      "caption": null,
      "title": null,
      "filters": [
        "Date Range Filter",
        "Hospital",
        "Parent Hospital",
        "Patient Class",
        "Unit"
      ],
      "sort": null,
      "formatting": {
        "colorPalette": null,
        "gridlines": null,
        "showFieldLabels": null,
        "markStroke": null,
        "showMarkLabels": true
      },
      "inferredVisualType": "card"
    }
  ],
  "dashboards": [
    {
      "name": "Info",
      "size": {
        "w": 1366,
        "h": 860
      },
      "title": null,
      "background": null,
      "zones": [
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Patient Days\nMidnight Census",
          "x": 33310,
          "y": 930,
          "w": 28401,
          "h": 16977
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "General Description",
          "x": 1684,
          "y": 23721,
          "w": 47950,
          "h": 5814
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "This dashboard provides information on Patient Days, calculated by Midnight Census. Filters applied will apply to all other tabs.",
          "x": 1684,
          "y": 29535,
          "w": 47950,
          "h": 10814
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Content/Definitions",
          "x": 1684,
          "y": 40349,
          "w": 47950,
          "h": 5814
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Midnight Census is based on ADT (Admission, Discharge, Transfer) Census events not marked Canceled.  Test patients are excluded.",
          "x": 1684,
          "y": 47326,
          "w": 47950,
          "h": 6046
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Source",
          "x": 50366,
          "y": 23721,
          "w": 47950,
          "h": 5814
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "The data source is based on freehand SQL and relies on ADT (Admission, Discharge, Transfer) data available via the Carolina Data Warehouse for Health (CDW-H).",
          "x": 50366,
          "y": 29535,
          "w": 47950,
          "h": 18139
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Contacts",
          "x": 50366,
          "y": 47674,
          "w": 47950,
          "h": 5814
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Austin Gilmore\nDashboard Creator, BI Analyst\naustin.gilmore@unchealth.unc.edu",
          "x": 50366,
          "y": 53488,
          "w": 47950,
          "h": 13139
        },
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Dashboard Refreshes Daily (08:30 AM)",
          "x": 50366,
          "y": 66627,
          "w": 47950,
          "h": 5814
        }
      ],
      "buttons": []
    },
    {
      "name": "Midnight Census",
      "size": {
        "w": 1366,
        "h": 860
      },
      "title": null,
      "background": null,
      "zones": [
        {
          "type": "text",
          "worksheet": null,
          "field": null,
          "text": "Patient Days by Midnight Census",
          "x": 586,
          "y": 930,
          "w": 98828,
          "h": 16163
        },
        {
          "type": "paramctrl",
          "worksheet": null,
          "field": "Date Agg Level",
          "x": 586,
          "y": 17093,
          "w": 12372,
          "h": 8023
        },
        {
          "type": "paramctrl",
          "worksheet": null,
          "field": "View",
          "x": 12958,
          "y": 17093,
          "w": 12371,
          "h": 8023
        },
        {
          "type": "paramctrl",
          "worksheet": null,
          "field": "Start Date",
          "x": 25329,
          "y": 17093,
          "w": 12372,
          "h": 8023
        },
        {
          "type": "paramctrl",
          "worksheet": null,
          "field": "End Date",
          "x": 37701,
          "y": 17093,
          "w": 12372,
          "h": 8023
        },
        {
          "type": "filter",
          "worksheet": "Filters",
          "field": "Parent Hospital",
          "x": 50073,
          "y": 17093,
          "w": 12372,
          "h": 8023
        },
        {
          "type": "filter",
          "worksheet": "Filters",
          "field": "Hospital",
          "x": 62445,
          "y": 17093,
          "w": 12372,
          "h": 8023
        },
        {
          "type": "filter",
          "worksheet": "Filters",
          "field": "Patient Class",
          "x": 74817,
          "y": 17093,
          "w": 12299,
          "h": 8023
        },
        {
          "type": "paramctrl",
          "worksheet": null,
          "field": "Filter Adults/Peds",
          "x": 87116,
          "y": 17093,
          "w": 12298,
          "h": 8023
        },
        {
          "type": "viz",
          "worksheet": "Partial Data Warning",
          "field": null,
          "x": 586,
          "y": 25116,
          "w": 98828,
          "h": 3721
        },
        {
          "type": "filter",
          "worksheet": "Filters",
          "field": "Unit",
          "x": 586,
          "y": 28837,
          "w": 21230,
          "h": 70233
        },
        {
          "type": "viz",
          "worksheet": "Monthly bar",
          "field": null,
          "x": 21816,
          "y": 28837,
          "w": 77598,
          "h": 62211
        },
        {
          "type": "viz",
          "worksheet": "Monthly table",
          "field": null,
          "x": 21816,
          "y": 91048,
          "w": 77598,
          "h": 1046
        },
        {
          "type": "viz",
          "worksheet": "Daily table",
          "field": null,
          "x": 21816,
          "y": 92094,
          "w": 77598,
          "h": 1046
        },
        {
          "type": "viz",
          "worksheet": "Daily bar",
          "field": null,
          "x": 21816,
          "y": 93140,
          "w": 77598,
          "h": 116
        },
        {
          "type": "viz",
          "worksheet": "Filters Applied Caption",
          "field": null,
          "x": 21816,
          "y": 93256,
          "w": 77598,
          "h": 5814
        },
        {
          "type": "viz",
          "worksheet": "Filters",
          "field": null,
          "x": 97145,
          "y": 1163,
          "w": 1977,
          "h": 3605
        }
      ],
      "buttons": []
    }
  ],
  "actions": [],
  "physicalTables": [
    {
      "name": "Midnight_Census_Template.csv",
      "columns": [
        "DEPARTMENT_KEY",
        "Encounter CSN",
        "Parent Hospital",
        "Hospital",
        "Unit",
        "Patient Class",
        "Census Date",
        "Census Count",
        "Census Count Adults",
        "Census Count Peds"
      ]
    }
  ],
  "columnTableMap": {},
  "relationships": [],
  "hierarchies": [],
  "sets": [],
  "groups": [],
  "bins": [],
  "theme": {
    "fontFamily": "Arial",
    "titleFontSize": "18",
    "worksheetFontSize": "14",
    "formatRules": {
      "axis.line-visibility": "off",
      "worksheet.font-size": "14",
      "gridline.line-visibility": "off",
      "zeroline.line-visibility": "off",
      "title.font-size": "18",
      "title.font-weight": "bold",
      "all.font-family": "Arial"
    },
    "markColors": [
      "#004263",
      "#999999"
    ]
  },
  "blending": {
    "blended": false,
    "datasources": [
      "Midnight_Census_Template"
    ]
  },
  "rls": {
    "detected": false,
    "type": null,
    "securedTable": null,
    "mappingTable": null,
    "userColumn": null,
    "signalField": null
  }
}