{
  "irVersion": "1.0",
  "workbook": {
    "name": "Netfix Workbook rls",
    "pascalName": "NetfixWorkbookRls",
    "sourcePath": "Data/Netflix RLS/Netfix Workbook rls.twb",
    "version": "18.1",
    "platform": ""
  },
  "dataSources": [
    {
      "name": "netflix_titles",
      "internalName": "federated.1ti9kv81mb5xop1auz1ya0a06id2",
      "connectionClass": "textscan",
      "sourceType": "CSV",
      "files": [
        "netflix_titles.csv",
        "C:/Users/AmanRajMAQSoftware/Downloads/semantic model generation v4/Data/Netflix RLS",
        "User_Access.csv"
      ],
      "server": "",
      "database": null,
      "schema": null,
      "tables": [
        "netflix_titles#csv",
        "User_Access#csv"
      ],
      "active": true
    }
  ],
  "columns": [
    {
      "datasource": "netflix_titles",
      "name": "show_id",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 0
    },
    {
      "datasource": "netflix_titles",
      "name": "type",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 1
    },
    {
      "datasource": "netflix_titles",
      "name": "title",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 2
    },
    {
      "datasource": "netflix_titles",
      "name": "director",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 3
    },
    {
      "datasource": "netflix_titles",
      "name": "cast",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 4
    },
    {
      "datasource": "netflix_titles",
      "name": "country",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 5
    },
    {
      "datasource": "netflix_titles",
      "name": "date_added",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 6
    },
    {
      "datasource": "netflix_titles",
      "name": "release_year",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 7
    },
    {
      "datasource": "netflix_titles",
      "name": "rating",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 8
    },
    {
      "datasource": "netflix_titles",
      "name": "duration",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 9
    },
    {
      "datasource": "netflix_titles",
      "name": "listed_in",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 10
    },
    {
      "datasource": "netflix_titles",
      "name": "description",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 11
    },
    {
      "datasource": "netflix_titles",
      "name": "Username",
      "caption": null,
      "dataType": "string",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 12
    },
    {
      "datasource": "netflix_titles",
      "name": "Year Added",
      "caption": null,
      "dataType": "integer",
      "role": "dimension",
      "semanticRole": null,
      "format": null,
      "ordinal": 13
    }
  ],
  "calculatedFields": [
    {
      "caption": "Year",
      "fieldName": "[Parameter 1]",
      "dataType": "date",
      "role": "measure",
      "formula": "#2024-03-26#",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    },
    {
      "caption": "RLS",
      "fieldName": "[Calculation_0182254345785358]",
      "dataType": "boolean",
      "role": "measure",
      "formula": "CONTAINS(\r\n    LOWER(IFNULL(ATTR([country]), \"\")),\r\n    LOWER(ATTR([country]))\r\n)\r\nAND LOWER(ATTR([Username])) = \"user2@maq.com\"",
      "isTableCalc": false,
      "complexity": "trivial",
      "suggestedDaxKind": "measure"
    }
  ],
  "parameters": [
    {
      "name": "Year",
      "internalName": "[Parameter 1]",
      "dataType": "date",
      "domainType": "any",
      "default": "#2024-03-26#",
      "values": []
    }
  ],
  "worksheets": [
    {
      "name": "Country wise distribution",
      "datasource": "netflix_titles",
      "markClass": "Multipolygon",
      "rows": [
        "federated.1ti9kv81mb5xop1auz1ya0a06id2].[Latitude (generated)"
      ],
      "cols": [
        "federated.1ti9kv81mb5xop1auz1ya0a06id2].[Longitude (generated)"
      ],
      "encodings": {
        "color": "federated.1ti9kv81mb5xop1auz1ya0a06id2].[ctd:show_id:qk",
        "size": null,
        "text": null
      },
      "categoryField": "Longitude (generated",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        "Longitude (generated",
        "Latitude (generated"
      ],
      "values": [],
      "caption": null,
      "inferredVisualType": null
    },
    {
      "name": "Description",
      "datasource": "netflix_titles",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.1ti9kv81mb5xop1auz1ya0a06id2].[none:description:nk"
      },
      "categoryField": null,
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [],
      "caption": null,
      "inferredVisualType": "card"
    },
    {
      "name": "Duration",
      "datasource": "netflix_titles",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.1ti9kv81mb5xop1auz1ya0a06id2].[none:duration:nk"
      },
      "categoryField": null,
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [],
      "caption": null,
      "inferredVisualType": "card"
    },
    {
      "name": "Genre",
      "datasource": "netflix_titles",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.1ti9kv81mb5xop1auz1ya0a06id2].[none:listed_in:nk"
      },
      "categoryField": null,
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [],
      "caption": null,
      "inferredVisualType": "card"
    },
    {
      "name": "Movies and TV Shows distribution",
      "datasource": "netflix_titles",
      "markClass": "Circle",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": "federated.1ti9kv81mb5xop1auz1ya0a06id2].[none:type:nk",
        "size": "federated.1ti9kv81mb5xop1auz1ya0a06id2].[ctd:show_id:qk",
        "text": "federated.1ti9kv81mb5xop1auz1ya0a06id2].[none:type:nk"
      },
      "categoryField": null,
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [],
      "caption": null,
      "inferredVisualType": "scatterChart"
    },
    {
      "name": "Rating",
      "datasource": "netflix_titles",
      "markClass": "Automatic",
      "rows": [],
      "cols": [],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.1ti9kv81mb5xop1auz1ya0a06id2].[none:rating:nk"
      },
      "categoryField": null,
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [],
      "values": [],
      "caption": null,
      "inferredVisualType": "card"
    },
    {
      "name": "Ratings",
      "datasource": "netflix_titles",
      "markClass": "Automatic",
      "rows": [
        "federated.1ti9kv81mb5xop1auz1ya0a06id2].[ctd:show_id:qk"
      ],
      "cols": [
        "federated.1ti9kv81mb5xop1auz1ya0a06id2].[none:rating:nk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.1ti9kv81mb5xop1auz1ya0a06id2].[ctd:show_id:qk"
      },
      "categoryField": "rating",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        "rating",
        "show_id"
      ],
      "values": [],
      "caption": null,
      "inferredVisualType": null
    },
    {
      "name": "Top 10 Genre",
      "datasource": "netflix_titles",
      "markClass": "Automatic",
      "rows": [
        "federated.1ti9kv81mb5xop1auz1ya0a06id2].[none:listed_in:nk"
      ],
      "cols": [
        "federated.1ti9kv81mb5xop1auz1ya0a06id2].[ctd:show_id:qk"
      ],
      "encodings": {
        "color": null,
        "size": null,
        "text": "federated.1ti9kv81mb5xop1auz1ya0a06id2].[ctd:show_id:qk"
      },
      "categoryField": "show_id",
      "valueField": null,
      "categoryDateLevel": null,
      "dimensions": [
        "show_id",
        "listed_in"
      ],
      "values": [],
      "caption": null,
      "inferredVisualType": null
    },
    {
      "name": "Total Movies and TV Shows by Years",
      "datasource": "netflix_titles",
      "markClass": "Area",
      "rows": [
        "federated.1ti9kv81mb5xop1auz1ya0a06id2].[ctd:show_id:qk"
      ],
      "cols": [
        "federated.1ti9kv81mb5xop1auz1ya0a06id2].[yr:Calculation_1138566281481768960:ok"
      ],
      "encodings": {
        "color": "federated.1ti9kv81mb5xop1auz1ya0a06id2].[none:type:nk",
        "size": null,
        "text": "federated.1ti9kv81mb5xop1auz1ya0a06id2].[none:type:nk"
      },
      "categoryField": "Calculation_1138566281481768960",
      "valueField": null,
      "categoryDateLevel": "year",
      "dimensions": [
        "Calculation_1138566281481768960",
        "show_id"
      ],
      "values": [],
      "caption": null,
      "inferredVisualType": "areaChart"
    }
  ],
  "dashboards": [
    {
      "name": "Netflix",
      "size": {
        "w": 1700,
        "h": 800
      },
      "zones": [
        {
          "type": "viz",
          "worksheet": "Total Movies and TV Shows by Years",
          "field": null,
          "x": 48000,
          "y": 60499,
          "w": 51529,
          "h": 38501
        },
        {
          "type": "viz",
          "worksheet": "Movies and TV Shows distribution",
          "field": null,
          "x": 64588,
          "y": 22000,
          "w": 34941,
          "h": 38499
        },
        {
          "type": "viz",
          "worksheet": "Ratings",
          "field": null,
          "x": 34765,
          "y": 22000,
          "w": 29823,
          "h": 38499
        },
        {
          "type": "viz",
          "worksheet": "Country wise distribution",
          "field": null,
          "x": 471,
          "y": 22000,
          "w": 34294,
          "h": 38499
        },
        {
          "type": "viz",
          "worksheet": "Top 10 Genre",
          "field": null,
          "x": 471,
          "y": 60499,
          "w": 47529,
          "h": 38501
        },
        {
          "type": "viz",
          "worksheet": "Description",
          "field": null,
          "x": 60529,
          "y": 1000,
          "w": 39000,
          "h": 21000
        },
        {
          "type": "viz",
          "worksheet": "Duration",
          "field": null,
          "x": 10059,
          "y": 10812,
          "w": 14941,
          "h": 11188
        },
        {
          "type": "viz",
          "worksheet": "Rating",
          "field": null,
          "x": 10059,
          "y": 1000,
          "w": 14941,
          "h": 9812
        },
        {
          "type": "viz",
          "worksheet": "Genre",
          "field": null,
          "x": 42764,
          "y": 1000,
          "w": 17765,
          "h": 21000
        },
        {
          "type": "filter",
          "worksheet": "Description",
          "field": "type",
          "x": 471,
          "y": 1000,
          "w": 9588,
          "h": 10125
        },
        {
          "type": "filter",
          "worksheet": "Description",
          "field": "title",
          "x": 471,
          "y": 11125,
          "w": 9588,
          "h": 10875
        }
      ],
      "buttons": []
    }
  ],
  "sets": [],
  "groups": [],
  "bins": [],
  "blending": {
    "blended": false,
    "datasources": [
      "netflix_titles"
    ]
  },
  "rls": {
    "detected": false,
    "type": null,
    "securedTable": null,
    "mappingTable": null,
    "userColumn": null
  }
}